##### Pandas - Getting started
[link](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html?highlight=basics)

# Essential basic functionality
Here we discuss a lot of the essential functionality common to the pandas data structures. Here’s how to create some of the objects used in the examples from the previous section:

In [1]:
import numpy as np
import pandas as pd

In [2]:
index = pd.date_range('1/1/2000', periods=8)
s     = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
df    = pd.DataFrame(np.random.randn(8, 3), index=index,
                     columns=['A', 'B', 'C'])

## Head and tail
To view a small sample of a Series or DataFrame object, use the [head()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html#pandas.DataFrame.head) and [tail()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html#pandas.DataFrame.tail) methods. The default number of elements to display is **five**, but you may pass a custom number.

In [3]:
long_series = pd.Series(np.random.randn(1000))
long_series.head()   # empty arg returns 5 entries

0    0.642536
1   -0.336547
2    1.108079
3   -0.162589
4   -0.247090
dtype: float64

In [4]:
long_series.tail(3)  # arg provides custom return

997    0.368604
998   -0.058433
999   -0.656039
dtype: float64

## Attributes and underlying data
pandas objects have a number of attributes enabling you to access the metadata

* **shape**: gives the axis dimensions of the object, consistent with ndarray
* **Axis labels**
    * **Series**: _index_ (only axis)
    * **DataFrame**: _index_ (rows) and columns

Note, **these attributes can be safely assigned to!**

In [5]:
df.shape

(8, 3)

In [6]:
df[:2]     # slicing :=all columns, 2=two rows

                   A         B         C
2000-01-01 -1.026258  0.105322 -1.321737
2000-01-02  0.898991 -0.150861 -0.024899

With DataFrame, slicing inside of `[]` **slices the rows**. This is provided largely as a convenience since it is such a common operation (see [Indexing and selecting data](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html)).

In [7]:
# change column index to lower case
df.columns = [x.lower() for x in df.columns] 
df

                   a         b         c
2000-01-01 -1.026258  0.105322 -1.321737
2000-01-02  0.898991 -0.150861 -0.024899
2000-01-03 -1.473454 -0.535228  0.031651
2000-01-04 -0.514971 -1.483568 -0.850580
2000-01-05 -1.090402  0.602836 -0.291703
2000-01-06 -1.421596 -0.651210 -0.405099
2000-01-07  2.338415 -1.475394 -0.622586
2000-01-08  0.380482 -0.489945 -1.866052

Pandas objects ([Index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Index.html#pandas.Index), [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series), [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame)) can be thought of as containers for arrays, which hold the actual data and do the actual computation. For many types, the underlying array is a [numpy.ndarray](https://docs.scipy.org/doc/numpy/reference/generated/numpy.ndarray.html#numpy.ndarray). However, pandas and 3rd party libraries may _extend_ NumPy’s type system to add support for custom arrays (see [dtypes](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#basics-dtypes)).

To get the actual data inside a [Index](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Index.html#pandas.Index) or [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html#pandas.Series), use the `.array` property

In [8]:
s.array

<PandasArray>
[-0.38442881456889366,   -2.005745304354905,   0.9231605413295707,
 -0.35588636451595107,  0.20711405948167935]
Length: 5, dtype: float64

In [9]:
s.index.array

<PandasArray>
['a', 'b', 'c', 'd', 'e']
Length: 5, dtype: object

[array](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.array.html#pandas.Series.array) will always be an [ExtensionArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.api.extensions.ExtensionArray.html#pandas.api.extensions.ExtensionArray). The exact details of what an [ExtensionArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.api.extensions.ExtensionArray.html#pandas.api.extensions.ExtensionArray) is and why pandas uses them is a bit beyond the scope of this introduction. See [dtypes](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#basics-dtypes) for more.

If you know you need a NumPy array, use [to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.to_numpy.html#pandas.Series.to_numpy) or `numpy.asarray()`.

In [10]:
s.to_numpy()

array([-0.38442881, -2.0057453 ,  0.92316054, -0.35588636,  0.20711406])

In [11]:
np.asarray(s)

array([-0.38442881, -2.0057453 ,  0.92316054, -0.35588636,  0.20711406])

When the Series or Index is backed by an [ExtensionArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.api.extensions.ExtensionArray.html#pandas.api.extensions.ExtensionArray), [to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.to_numpy.html#pandas.Series.to_numpy) may involve copying data and coercing values. See [dtypes](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#basics-dtypes) for more.

[to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.to_numpy.html#pandas.Series.to_numpy) gives some control over the `dtype` of the resulting [numpy.ndarray](https://docs.scipy.org/doc/numpy/reference/generated/numpy.ndarray.html#numpy.ndarray). For example, consider datetimes with timezones. NumPy doesn’t have a dtype to represent **timezone-aware datetimes**, so there are two possibly useful representations:

1. An object-dtype [numpy.ndarray](https://docs.scipy.org/doc/numpy/reference/generated/numpy.ndarray.html#numpy.ndarray) with [Timestamp](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timestamp.html#pandas.Timestamp) objects, each with the correct **tz**
2. A `datetime64[ns]` -dtype [numpy.ndarray](https://docs.scipy.org/doc/numpy/reference/generated/numpy.ndarray.html#numpy.ndarray), where the values have been converted to **UTC** and the timezone discarded

Timezones may be preserved with `dtype=object`

In [12]:
ser = pd.Series(pd.date_range('2000', periods=2, tz="CET"))
ser.to_numpy(dtype=object)

array([Timestamp('2000-01-01 00:00:00+0100', tz='CET', freq='D'),
       Timestamp('2000-01-02 00:00:00+0100', tz='CET', freq='D')],
      dtype=object)

Or thrown away with `dtype='datetime64[ns]'`

In [13]:
ser.to_numpy(dtype="datetime64[ns]")

array(['1999-12-31T23:00:00.000000000', '2000-01-01T23:00:00.000000000'],
      dtype='datetime64[ns]')

Getting the “raw data” inside a [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame) is possibly a bit more complex. When your `DataFrame` only has a single data type for all the columns, [DataFrame.to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy) will return the underlying data:

In [14]:
df.to_numpy()

array([[-1.0262583 ,  0.10532158, -1.32173689],
       [ 0.89899051, -0.15086096, -0.02489855],
       [-1.47345414, -0.5352281 ,  0.03165133],
       [-0.51497143, -1.48356756, -0.85057983],
       [-1.09040221,  0.60283596, -0.29170346],
       [-1.42159631, -0.65121038, -0.40509866],
       [ 2.33841499, -1.47539446, -0.62258588],
       [ 0.38048192, -0.48994531, -1.86605152]])

If a DataFrame contains **homogeneously-typed data**, the ndarray can actually be modified in-place, and the changes will be reflected in the data structure. For **heterogeneous data** (e.g. some of the DataFrame’s columns are not all the same dtype), this will not be the case. The values attribute itself, unlike the axis labels, cannot be assigned to.

>**Note**
>
>When working with heterogeneous data, the dtype of the resulting ndarray will be chosen to accommodate all of the data involved. For example, if strings are involved, the result will be of object dtype. If there are only floats and integers, the resulting array will be of float dtype.

In the past, pandas recommended [Series.values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.values.html#pandas.Series.values) or [DataFrame.values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.values.html#pandas.DataFrame.values) for extracting the data from a Series or DataFrame. You’ll still find references to these in old code bases and online. Going forward, we recommend **avoiding** `.values` and using `.array` or `.to_numpy()`. `.values` has the following drawbacks:

1. When your Series contains an [extension type](https://pandas.pydata.org/pandas-docs/stable/development/extending.html#extending-extension-types), it’s unclear whether [Series.values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.values.html#pandas.Series.values) returns a NumPy array or the extension array. [Series.array](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.array.html#pandas.Series.array) will always return an [ExtensionArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.api.extensions.ExtensionArray.html#pandas.api.extensions.ExtensionArray), and will never copy data. [Series.to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.to_numpy.html#pandas.Series.to_numpy) will always return a NumPy array, potentially at the cost of copying / coercing values.

2. When your DataFrame contains a mixture of data types, [DataFrame.values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.values.html#pandas.DataFrame.values) may involve copying data and coercing values to a common dtype, a relatively expensive operation. [DataFrame.to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy), being a method, makes it clearer that the returned NumPy array may not be a view on the same data in the DataFrame.

## Accelerated operations
pandas has support for accelerating certain types of binary numerical and boolean operations using the `numexpr` library and the `bottleneck` libraries.

These libraries are especially useful when dealing with large data sets, and provide large speedups. `numexpr` uses smart chunking, caching, and multiple cores. `bottleneck` is a set of specialized cython routines that are especially fast when dealing with arrays that have `nans`.

Here is a sample (using 100 column x 100,000 row `DataFrames`):

| Operation | 0.11.0 (ms) | Prior Version (ms) | Ratio to Prior |
|-----------|-------------|--------------------|----------------|
| df1 > df2 | 13.32       | 125.35             | 0.1063         | 
| df1 * df2 | 21.71       |  36.63             | 0.5928         |
| df1 + df2 | 22.04       |  36.50             | 0.6039         |

You are highly encouraged to install both libraries. See the section [Recommended Dependencies](https://pandas.pydata.org/pandas-docs/stable/getting_started/install.html#install-recommended-dependencies) for more installation info.

These are both enabled to be used by default, you can control this by setting the options:

In [15]:
pd.set_option('compute.use_bottleneck', False)
pd.set_option('compute.use_bottleneck', False)

## Flexible binary operations
With binary operations between pandas data structures, there are two key points of interest:

* Broadcasting behavior between higher- (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.
* Missing data in computations.

We will demonstrate how to manage these issues independently, though they can be handled simultaneously.

### Matching / broadcasting behavior
DataFrame has the methods [add()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.add.html#pandas.DataFrame.add), [sub()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sub.html#pandas.DataFrame.sub), [mul()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mul.html#pandas.DataFrame.mul), [div()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.div.html#pandas.DataFrame.div) and related functions [radd()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.radd.html#pandas.DataFrame.radd), [rsub()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rsub.html#pandas.DataFrame.rsub), … for carrying out binary operations. For broadcasting behavior, Series input is of primary interest. Using these functions, you can use to either match on the _index_ or _columns_ via the **axis** keyword:

In [16]:
df = pd.DataFrame({'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                   'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                   'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df

        one       two     three
a -0.198403  0.501065       NaN
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086
d       NaN -0.201570 -0.974622

In [17]:
# using 0-based 'iloc' to zero-out the second value in each series (i.e., 'colomns')
row    = df.iloc[1]
column = df['two']
df.sub(row, axis='columns')

        one       two     three
a -1.253177 -1.022503       NaN
b  0.000000  0.000000  0.000000
c -1.627656 -1.557065  0.243405
d       NaN -1.725137 -1.641303

In [18]:
# same as above but with axis defined by 0-based number
df.sub(row, axis=1)

        one       two     three
a -1.253177 -1.022503       NaN
b  0.000000  0.000000  0.000000
c -1.627656 -1.557065  0.243405
d       NaN -1.725137 -1.641303

In [19]:
# subtract 'column=df['two']' from each series, this will zero-out the second column
df.sub(column, axis='index')

        one  two     three
a -0.699468  0.0       NaN
b -0.468794  0.0 -0.856886
c -0.539384  0.0  0.943584
d       NaN  0.0 -0.773052

In [20]:
# same as above but with axis defined by 0-based number (i.e., 0=colunns, 1=rows)
df.sub(column, axis=0)

        one  two     three
a -0.699468  0.0       NaN
b -0.468794  0.0 -0.856886
c -0.539384  0.0  0.943584
d       NaN  0.0 -0.773052

Furthermore you can align a level of a MultiIndexed DataFrame with a Series.

In [21]:
dfmi       = df.copy()
dfmi.index = pd.MultiIndex.from_tuples([(1, 'a'), (1, 'b'),
                                        (1, 'c'), (2, 'a')],
                                        names=['first', 'second'])
dfmi    # the same three series in a multi-indexed dataframe

                   one       two     three
first second
1     a      -0.198403  0.501065       NaN
      b       1.054774  1.523568  0.666681
      c      -0.572882 -0.033498  0.910086
2     a            NaN -0.201570 -0.974622

In [22]:
# same as 'df.sub(column, axis=0)' but now we need the 'level' defined
dfmi.sub(column, axis=0, level='second')

                   one       two     three
first second
1     a      -0.699468  0.000000       NaN
      b      -0.468794  0.000000 -0.856886
      c      -0.539384  0.000000  0.943584
2     a            NaN -0.702635 -1.475687

Series and Index also support the [divmod()](https://docs.python.org/3/library/functions.html#divmod) builtin. This function takes the floor division and modulo operation at the same time returning a two-tuple of the same type as the left hand side. For example:

In [23]:
s = pd.Series(np.arange(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [24]:
div, rem = divmod(s, 3)
div

0    0
1    0
2    0
3    1
4    1
5    1
6    2
7    2
8    2
9    3
dtype: int32

In [25]:
rem

0    0
1    1
2    2
3    0
4    1
5    2
6    0
7    1
8    2
9    0
dtype: int32

In [26]:
idx = pd.Index(np.arange(10))
idx

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [27]:
div, rem = divmod(idx, 3)
div

Int64Index([0, 0, 0, 1, 1, 1, 2, 2, 2, 3], dtype='int64')

In [28]:
rem

Int64Index([0, 1, 2, 0, 1, 2, 0, 1, 2, 0], dtype='int64')

We can also do elementwise [divmod()](https://docs.python.org/3/library/functions.html#divmod):

In [29]:
div, rem = divmod(s, [2, 2, 3, 3, 4, 4, 5, 5, 6, 6])
div

0    0
1    0
2    0
3    1
4    1
5    1
6    1
7    1
8    1
9    1
dtype: int32

In [30]:
rem

0    0
1    1
2    2
3    0
4    0
5    1
6    1
7    2
8    2
9    3
dtype: int32

### Missing data / operations with fill values
In Series and DataFrame, the arithmetic functions have the option of inputting a `fill_value`, namely a value to substitute when at most one of the values at a location are missing. For example, when adding two DataFrame objects, you may wish to treat NaN as 0 unless both DataFrames are missing that value, in which case the result will be NaN (you can later replace NaN with some other value using `fillna` if you wish).

In [31]:
df

        one       two     three
a -0.198403  0.501065       NaN
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086
d       NaN -0.201570 -0.974622

In [32]:
df2 = pd.DataFrame({'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                    'three': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd'])})

df2

        one       two     three
a -1.333667 -1.890132 -0.121680
b -1.017202 -0.129492  0.405544
c  0.921073  2.504440  0.681999
d       NaN  1.252556  0.866600

In [33]:
df + df2

        one       two     three
a -1.532070 -1.389067       NaN
b  0.037571  1.394076  1.072225
c  0.348191  2.470942  1.592084
d       NaN  1.050986 -0.108022

In [34]:
df.add(df2, fill_value=0)

        one       two     three
a -1.532070 -1.389067 -0.121680
b  0.037571  1.394076  1.072225
c  0.348191  2.470942  1.592084
d       NaN  1.050986 -0.108022

### Flexible comparisons
Series and DataFrame have the binary comparison methods `eq`, `ne`, `lt`, `gt`, `le`, and `ge` whose behavior is analogous to the binary arithmetic operations described above:

In [35]:
df.gt(df2)

     one    two  three
a   True   True  False
b   True   True   True
c  False  False   True
d  False  False  False

In [36]:
df2.ne(df)

    one   two  three
a  True  True   True
b  True  True   True
c  True  True   True
d  True  True   True

These operations produce a pandas object of the same type as the left-hand-side input that is of dtype `bool`. These `boolean` objects can be used in indexing operations, see the section on [Boolean indexing](https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-boolean).

### Boolean reductions
You can apply the reductions: [empty](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.empty.html#pandas.DataFrame.empty), [any()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.any.html#pandas.DataFrame.any), [all()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.all.html#pandas.DataFrame.all), and [bool()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.bool.html#pandas.DataFrame.bool) to provide a way to summarize a boolean result.

In [37]:
(df > 0).all()

one      False
two      False
three    False
dtype: bool

In [38]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

You can reduce to a final boolean value.

In [39]:
(df > 0).any().any()

True

You can test if a pandas object is empty, via the [empty](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.empty.html#pandas.DataFrame.empty) property.

In [40]:
df.empty

False

In [41]:
pd.DataFrame(columns=list('ABC')).empty

True

To evaluate single-element pandas objects in a boolean context, use the method [bool()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.bool.html#pandas.DataFrame.bool):

In [42]:
pd.Series([True]).bool()

True

In [43]:
pd.Series([False]).bool()

False

In [44]:
pd.DataFrame([[True]]).bool()

True

In [45]:
pd.DataFrame([[False]]).bool()

False

>**Warning**
>
>You might be tempted to do the following:

        >>> if df:
        ...     pass

>Or

        >>> df and df2

>These will both raise errors, as you are trying to compare multiple values.:


        ValueError: The truth value of an array is ambiguous. Use a.empty, a.any() or a.all().

See [gotchas](https://pandas.pydata.org/pandas-docs/stable/user_guide/gotchas.html#gotchas-truth) for a more detailed discussion.

### Comparing if objects are equivalent
Often you may find that there is more than one way to compute the same result. As a simple example, consider `df + df` and `df * 2`. To test that these two computations produce the same result, given the tools shown above, you might imagine using `(df + df == df * 2).all()`. But in fact, this expression is False:

In [46]:
df + df == df * 2

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [47]:
(df + df == df * 2).all()

one      False
two       True
three    False
dtype: bool

Notice that the boolean DataFrame `df + df == df * 2` contains some False values! This is because NaNs do not compare as equals:

In [48]:
np.nan == np.nan

False

So, NDFrames (such as Series and DataFrames) have an [equals()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.equals.html#pandas.DataFrame.equals) method for testing equality, with NaNs in corresponding locations treated as equal.

In [49]:
(df + df).equals(df * 2)

True

Note that the Series or DataFrame index needs to be in the same order for equality to be True:

In [50]:
df1 = pd.DataFrame({'col': ['foo', 0, np.nan]})
df2 = pd.DataFrame({'col': [np.nan, 0, 'foo']}, index=[2, 1, 0])
df1.equals(df2)

False

In [51]:
df1.equals(df2.sort_index())

True

### Comparing array-like objects
You can conveniently perform element-wise comparisons when comparing a pandas data structure with a scalar value:

In [52]:
pd.Series(['foo', 'bar', 'baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [53]:
pd.Index(['foo', 'bar', 'baz']) == 'foo'

array([ True, False, False])

Pandas also handles element-wise comparisons between different array-like objects of the same length:

In [54]:
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

Trying to compare `Index` or `Series` objects of different lengths will raise a **ValueError**:

In [55]:
pd.Series(['foo', 'bar', 'baz']) == pd.Series(['foo', 'bar'])

ValueError: Can only compare identically-labeled Series objects

In [56]:
pd.Series(['foo', 'bar', 'baz']) == pd.Series(['foo'])

ValueError: Can only compare identically-labeled Series objects

Note that this is different from the NumPy behavior where a comparison can be broadcast:

In [57]:
np.array([1, 2, 3]) == np.array([2])

array([False,  True, False])

or it can return False if broadcasting can not be done:

In [58]:
np.array([1, 2, 3]) == np.array([1, 2])

C:\bin\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: elementwise comparison failed; this will raise an error in the future.
  """Entry point for launching an IPython kernel.

False

### Combining overlapping data sets
A problem occasionally arising is the combination of two similar data sets where values in one are preferred over the other. An example would be two data series representing a particular economic indicator where one is considered to be of “higher quality”. However, the lower quality series might extend further back in history or have more complete data coverage. As such, we would like to combine two DataFrame objects where missing values in one DataFrame are conditionally filled with like-labeled values from the other DataFrame. The function implementing this operation is [combine_first()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.combine_first.html#pandas.DataFrame.combine_first), which we illustrate:

In [59]:
df1 = pd.DataFrame({'A': [1., np.nan, 3., 5., np.nan],
                    'B': [np.nan, 2., 3., np.nan, 6.]})
df2 = pd.DataFrame({'A': [5., 2., 4., np.nan, 3., 7.],
                    'B': [np.nan, np.nan, 3., 4., 6., 8.]})
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [60]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

In [61]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

### General DataFrame combine
The [combine_first()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.combine_first.html#pandas.DataFrame.combine_first) method above calls the more general [DataFrame.combine()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.combine.html#pandas.DataFrame.combine). This method takes another DataFrame and a combiner function, aligns the input DataFrame and then passes the combiner function pairs of Series (i.e., columns whose names are the same).

So, for instance, to reproduce [combine_first()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.combine_first.html#pandas.DataFrame.combine_first) as above:

In [62]:
def combiner(x, y):
    return np.where(pd.isna(x), y, x)

## Descriptive statistics
There exists a large number of methods for computing descriptive statistics and other related operations on [Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html#api-series-stats), [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/frame.html#api-dataframe-stats). Most of these are aggregations (hence producing a lower-dimensional result) like [sum()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sum.html#pandas.DataFrame.sum), [mean()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.mean.html#pandas.DataFrame.mean), and [quantile()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.quantile.html#pandas.DataFrame.quantile), but some of them, like [cumsum()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.cumsum.html#pandas.DataFrame.cumsum) and [cumprod()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.cumprod.html#pandas.DataFrame.cumprod), produce an object of the same size. Generally speaking, these methods take an **axis** argument, just like _ndarray.{sum, std, …}_, but the axis can be specified by name or integer:

* **Series**: no axis argument needed
* **DataFrame**: “index” (axis=0, default), “columns” (axis=1)

For example:

In [63]:
df

        one       two     three
a -0.198403  0.501065       NaN
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086
d       NaN -0.201570 -0.974622

In [64]:
df.mean(0)

one      0.094496
two      0.447391
three    0.200715
dtype: float64

In [65]:
df.mean(1)

a    0.151331
b    1.081674
c    0.101235
d   -0.588096
dtype: float64

All such methods have a `skipna` option signaling whether to exclude missing data (`True` by default):

In [66]:
df.sum(0, skipna=False)

one           NaN
two      1.789565
three         NaN
dtype: float64

In [67]:
df.sum(axis=1, skipna=True)

a    0.302662
b    3.245023
c    0.303706
d   -1.176192
dtype: float64

Combined with the broadcasting / arithmetic behavior, one can describe various statistical procedures, like standardization (rendering data zero mean and standard deviation 1), very concisely:

In [68]:
ts_stand = (df - df.mean()) / df.std()
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [69]:
xs_stand = df.sub(df.mean(1), axis=0).div(df.std(1), axis=0)
xs_stand.std(1)

a    1.0
b    1.0
c    1.0
d    1.0
dtype: float64

Note that methods like [cumsum()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.cumsum.html#pandas.DataFrame.cumsum) and [cumprod()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.cumprod.html#pandas.DataFrame.cumprod) preserve the location of `NaN` values. This is somewhat different from [expanding()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.expanding.html#pandas.DataFrame.expanding) and [rolling()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rolling.html#pandas.DataFrame.rolling). For more details please see [this note](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#stats-moments-expanding-note).

| Function | Description                                |
|----------|--------------------------------------------|
| count    | Number of non-NA observations              |
| sum      | Sum of values                              |
| mean     | Mean of values                             |
| mad      | Mean absolute deviation                    |
| median   | Arithmetic median of values                |
| min      | Minimum                                    |
| max      | Maximum                                    |
| mode     | Mode                                       |
| abs      | Absolute Value                             |
| prod     | Product of values                          |
| std      | Bessel-corrected sample standard deviation |
| var      | Unbiased variance                          |
| sem      | Standard error of the mean                 |
| skew     | Sample skewness (3rd moment)               |
| kurt     | Sample kurtosis (4th moment)               |
| quantile | Sample quantile (value at %)               |
| cumsum   | Cumulative sum                             |
| cumprod  | Cumulative product                         |
| cummax   | Cumulative maximum                         |
| cummin   | Cumulative minimum                         |

Note that by chance some NumPy methods, like `mean`, `std`, and `sum`, will exclude NAs on Series input by default:

In [70]:
np.mean(df['one'])

0.09449615670054638

In [71]:
np.mean(df['one'].to_numpy())

nan

[Series.nunique()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.nunique.html#pandas.Series.nunique) will return the number of unique non-NA values in a Series:

In [72]:
series         = pd.Series(np.random.randn(500))
series[20:500] = np.nan
series[10:20]  = 5
series.nunique()

11

### Summarizing data: describe
There is a convenient [describe()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html#pandas.DataFrame.describe) function which computes a variety of summary statistics about a Series or the columns of a DataFrame (excluding NAs of course):

In [73]:
series      = pd.Series(np.random.randn(1000))
series[::2] = np.nan
series.describe()

count    500.000000
mean       0.024900
std        0.977048
min       -3.009580
25%       -0.655492
50%        0.052722
75%        0.723227
max        3.635194
dtype: float64

In [74]:
frame = pd.DataFrame(np.random.randn(1000, 5),
                     columns=['a', 'b', 'c', 'd', 'e'])
frame.iloc[::2] = np.nan
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean    -0.048337   -0.020919   -0.130550   -0.024773    0.047476
std      1.016557    1.017564    0.980202    0.998679    0.973844
min     -3.039908   -3.428611   -2.948738   -3.277329   -3.040021
25%     -0.784312   -0.681676   -0.813244   -0.669365   -0.563746
50%     -0.100528    0.019738   -0.174805   -0.056618    0.053262
75%      0.584049    0.630380    0.494193    0.659962    0.704226
max      3.966442    2.855605    3.533452    3.161971    2.582589

You can select specific percentiles to include in the output:

In [75]:
series.describe(percentiles=[.05, .25, .75, .95])

count    500.000000
mean       0.024900
std        0.977048
min       -3.009580
5%        -1.593776
25%       -0.655492
50%        0.052722
75%        0.723227
95%        1.638428
max        3.635194
dtype: float64

By default, the median is always included.

For a non-numerical Series object, [describe()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.describe.html#pandas.Series.describe) will give a simple summary of the number of unique values and most frequently occurring values:

In [76]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])

Note that on a mixed-type DataFrame object, [describe()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.describe.html#pandas.DataFrame.describe) will restrict the summary to include only numerical columns or, if none are, only categorical columns:

In [77]:
frame = pd.DataFrame({'a': ['Yes', 'Yes', 'No', 'No'], 'b': range(4)})
frame.describe()

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

This behavior can be controlled by providing a list of types as `include/exclude` arguments. The special value `all` can also be used:

In [78]:
frame.describe(include=['object'])

         a
count    4
unique   2
top     No
freq     2

In [79]:
frame.describe(include=['number'])

              b
count  4.000000
mean   1.500000
std    1.290994
min    0.000000
25%    0.750000
50%    1.500000
75%    2.250000
max    3.000000

In [81]:
frame.describe(include='all')

          a         b
count     4  4.000000
unique    2       NaN
top      No       NaN
freq      2       NaN
mean    NaN  1.500000
std     NaN  1.290994
min     NaN  0.000000
25%     NaN  0.750000
50%     NaN  1.500000
75%     NaN  2.250000
max     NaN  3.000000

That feature relies on [select_dtypes](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#basics-selectdtypes). Refer to there for details about accepted inputs.

### Index of min/max values
The [idxmin()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmin.html#pandas.DataFrame.idxmin) and [idxmax()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmax.html#pandas.DataFrame.idxmax) functions on Series and DataFrame compute the index labels with the minimum and maximum corresponding values:

In [82]:
s1 = pd.Series(np.random.randn(5))
s1

0   -1.599218
1    1.244922
2   -0.594627
3    0.933922
4    0.169381
dtype: float64

In [83]:
s1.idxmin(), s1.idxmax()

(0, 1)

In [84]:
df1 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df1

          A         B         C
0  1.557540  0.997597  0.175267
1  0.437836 -0.564792  0.607669
2  0.138858 -1.006108  0.418680
3 -0.258778 -0.133796  0.598016
4 -1.002964 -0.167460 -0.166243

In [85]:
df1.idxmin(axis=0)

A    4
B    2
C    4
dtype: int64

In [86]:
df1.idxmax(axis=1)

0    A
1    C
2    C
3    C
4    C
dtype: object

When there are multiple rows (or columns) matching the minimum or maximum value, [idxmin()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmin.html#pandas.DataFrame.idxmin) and [idxmax()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.idxmax.html#pandas.DataFrame.idxmax) return the first matching index:

In [87]:
df3 = pd.DataFrame([2, 1, 1, 3, np.nan], columns=['A'], index=list('edcba'))
df3

     A
e  2.0
d  1.0
c  1.0
b  3.0
a  NaN

In [88]:
df3['A'].idxmin()

'd'

>Note
>
>`idxmin` and `idxmax` are called `argmin` and `argmax` in NumPy.

### Value counts (histogramming) / mode
The [value_counts()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html#pandas.Series.value_counts) Series method and top-level function computes a histogram of a 1D array of values. It can also be used as a function on regular arrays:

In [89]:
data = np.random.randint(0, 7, size=50)
data

array([0, 3, 1, 0, 6, 4, 0, 4, 4, 5, 1, 4, 4, 6, 5, 0, 3, 0, 4, 0, 1, 1,
       6, 0, 0, 2, 0, 5, 5, 3, 1, 2, 3, 4, 2, 5, 1, 3, 4, 5, 2, 6, 5, 6,
       6, 1, 3, 1, 6, 4])

In [90]:
s = pd.Series(data)
s.value_counts()

4    9
0    9
1    8
6    7
5    7
3    6
2    4
dtype: int64

In [91]:
pd.value_counts(data)

4    9
0    9
1    8
6    7
5    7
3    6
2    4
dtype: int64

Similarly, you can get the most frequently occurring value(s) (the mode) of the values in a Series or DataFrame:

In [92]:
s5 = pd.Series([1, 1, 3, 3, 3, 5, 5, 7, 7, 7])
s5.mode()

0    3
1    7
dtype: int64

In [93]:
df5 = pd.DataFrame({"A": np.random.randint(0, 7, size=50),
                    "B": np.random.randint(-10, 15, size=50)})
df5.mode()

   A  B
0  4 -4

### Discretization and quantiling
Continuous values can be discretized using the cut() (bins based on values) and [qcut()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html#pandas.qcut) (bins based on sample quantiles) functions:

In [94]:
arr    = np.random.randn(20)
factor = pd.cut(arr, 4)
factor

[(-1.151, -0.00077], (-0.00077, 1.15], (-0.00077, 1.15], (-0.00077, 1.15], (-2.306, -1.151], ..., (-0.00077, 1.15], (1.15, 2.3], (-1.151, -0.00077], (-1.151, -0.00077], (-1.151, -0.00077]]
Length: 20
Categories (4, interval[float64]): [(-2.306, -1.151] < (-1.151, -0.00077] < (-0.00077, 1.15] < (1.15, 2.3]]

In [95]:
factor = pd.cut(arr, [-5, -1, 0, 1, 5])
factor

[(-1, 0], (0, 1], (0, 1], (0, 1], (-5, -1], ..., (0, 1], (1, 5], (-1, 0], (-1, 0], (-1, 0]]
Length: 20
Categories (4, interval[int64]): [(-5, -1] < (-1, 0] < (0, 1] < (1, 5]]

[qcut()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html#pandas.qcut) computes sample quantiles. For example, we could slice up some normally distributed data into equal-size quartiles like so:

In [96]:
arr    = np.random.randn(30)
factor = pd.qcut(arr, [0, .25, .5, .75, 1])
factor

[(-0.682, 0.165], (-0.682, 0.165], (-0.682, 0.165], (0.84, 1.877], (-0.682, 0.165], ..., (0.84, 1.877], (0.84, 1.877], (0.84, 1.877], (0.84, 1.877], (-1.8599999999999999, -0.682]]
Length: 30
Categories (4, interval[float64]): [(-1.8599999999999999, -0.682] < (-0.682, 0.165] < (0.165, 0.84] < (0.84, 1.877]]

In [97]:
pd.value_counts(factor)

(0.84, 1.877]                    8
(-1.8599999999999999, -0.682]    8
(0.165, 0.84]                    7
(-0.682, 0.165]                  7
dtype: int64

We can also pass infinite values to define the bins:

In [98]:
arr    = np.random.randn(20)
factor = pd.cut(arr, [-np.inf, 0, np.inf])
factor

[(0.0, inf], (0.0, inf], (-inf, 0.0], (-inf, 0.0], (-inf, 0.0], ..., (-inf, 0.0], (-inf, 0.0], (-inf, 0.0], (0.0, inf], (-inf, 0.0]]
Length: 20
Categories (2, interval[float64]): [(-inf, 0.0] < (0.0, inf]]

## Function application
To apply your own or another library’s functions to pandas objects, you should be aware of the three methods below. The appropriate method to use depends on whether your function expects to operate on an entire `DataFrame` or `Series`, row- or column-wise, or elementwise.

1. [Tablewise Function Application](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#tablewise-function-application): [pipe()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pipe.html#pandas.DataFrame.pipe)
2. [Row or Column-wise Function Application](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#row-or-column-wise-function-application): [apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply)
3. [Aggregation API: agg()](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#aggregation-api) and [transform()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html#pandas.DataFrame.transform)
4. [Applying Elementwise Functions](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#applying-elementwise-functions): [applymap()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.applymap.html#pandas.DataFrame.applymap)

### Tablewise function application
`DataFrames` and `Series` can be passed into functions. However, if the function needs to be called in a chain, consider using the pipe() method.

First some setup:

In [99]:
def extract_city_name(df):
     """
     Chicago, IL -> Chicago for city_name column
     """
     df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
     return df

def add_country_name(df, country_name=None):
     """
     Chicago -> Chicago-US for city_name column
     """
     col = 'city_name'
     df['city_and_country'] = df[col] + country_name
     return df

df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})

`extract_city_name` and `add_country_name` are functions taking and returning `DataFrames`.

Now compare the following:

In [100]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

Is equivalent to:

In [101]:
(df_p.pipe(extract_city_name)
      .pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

Pandas encourages the second style, which is known as method chaining. `pipe` makes it easy to use your own or another library’s functions in method chains, alongside pandas’ methods.

In the example above, the functions `extract_city_name` and `add_country_name` each expected a `DataFrame` as the first positional argument. What if the function you wish to apply takes its data as, say, the second argument? In this case, provide pipe with a tuple of `(callable, data_keyword). .pipe` will route the `DataFrame` to the argument specified in the tuple.

For example, we can fit a regression using statsmodels. Their API expects a formula first and a DataFrame as the second argument, `data`. We pass in the function, keyword pair `(sm.ols, 'data')` to `pipe`:

In [102]:
import statsmodels.formula.api as sm

In [103]:
bb = pd.read_csv('data/baseball.csv', index_col='id')
(bb.query('h > 0')
    .assign(ln_h=lambda df: np.log(df.h))
    .pipe((sm.ols, 'data'), 'hr ~ ln_h + year + g + C(lg)')
    .fit()
    .summary()
  )

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                     hr   R-squared:                       0.685
Model:                            OLS   Adj. R-squared:                  0.665
Method:                 Least Squares   F-statistic:                     34.28
Date:                Sun, 02 Feb 2020   Prob (F-statistic):           3.48e-15
Time:                        19:43:01   Log-Likelihood:                -205.92
No. Observations:                  68   AIC:                             421.8
Df Residuals:                      63   BIC:                             432.9
Df Model:                           4
Covariance Type:            nonrobust
===============================================================================
                  coef    std err          t      P>|t|      [0.025      0.975]
-------------------------------------------------------------------------------
Intercept   -8484.7720   4664.146     -1.819      0.074   -1.78e+04     835.780
C(lg)[T.NL]    -2.2736      1.325     -1.716      0.091      -4.922       0.375
ln_h           -1.3542      0.875     -1.547      0.127      -3.103       0.395
year            4.2277      2.324      1.819      0.074      -0.417       8.872
g               0.1841      0.029      6.258      0.000       0.125       0.243
==============================================================================
Omnibus:                       10.875   Durbin-Watson:                   1.999
Prob(Omnibus):                  0.004   Jarque-Bera (JB):               17.298
Skew:                           0.537   Prob(JB):                     0.000175
Kurtosis:                       5.225   Cond. No.                     1.49e+07
==============================================================================

Warnings:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The condition number is large, 1.49e+07. This might indicate that there are
strong multicollinearity or other numerical problems.
"""

The pipe method is inspired by unix pipes and more recently [dplyr](https://github.com/hadley/dplyr) and [magrittr](https://github.com/smbache/magrittr), which have introduced the popular `(%>%)` (read pipe) operator for [R](https://www.r-project.org/). The implementation of `pipe` here is quite clean and feels right at home in python. We encourage you to view the source code of [pipe()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.pipe.html#pandas.DataFrame.pipe).

### Row or column-wise function application
Arbitrary functions can be applied along the axes of a DataFrame using the [apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply) method, which, like the descriptive statistics methods, takes an optional `axis` argument:

In [104]:
df.apply(np.mean)

one      0.094496
two      0.447391
three    0.200715
dtype: float64

In [105]:
df.apply(np.mean, axis=1)

a    0.151331
b    1.081674
c    0.101235
d   -0.588096
dtype: float64

In [106]:
df.apply(lambda x: x.max() - x.min())

one      1.627656
two      1.725137
three    1.884708
dtype: float64

In [107]:
df.apply(np.cumsum)

        one       two     three
a -0.198403  0.501065       NaN
b  0.856371  2.024633  0.666681
c  0.283488  1.991135  1.576767
d       NaN  1.789565  0.602145

In [108]:
df.apply(np.exp)

        one       two     three
a  0.820039  1.650478       NaN
b  2.871326  4.588566  1.947763
c  0.563898  0.967057  2.484536
d       NaN  0.817447  0.377335

The [apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply) method will also dispatch on a string method name.

In [109]:
df.apply('mean')

one      0.094496
two      0.447391
three    0.200715
dtype: float64

In [110]:
df.apply('mean', axis=1)

a    0.151331
b    1.081674
c    0.101235
d   -0.588096
dtype: float64

The return type of the function passed to [apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply) affects the type of the final output from `DataFrame.apply` for the default behaviour:

* If the applied function returns a `Series`, the final output is a `DataFrame`. The columns match the index of the `Series` returned by the applied function.
* If the applied function returns any other type, the final output is a Series.

This default behaviour can be overridden using the `result_type`, which accepts three options: `reduce`, `broadcast`, and `expand`. These will determine how list-likes return values expand (or not) to a `DataFrame`.

[apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply) combined with some cleverness can be used to answer many questions about a data set. For example, suppose we wanted to extract the date where the maximum value for each column occurred:

In [111]:
tsdf = pd.DataFrame(np.random.randn(1000, 3), columns=['A', 'B', 'C'],
                    index=pd.date_range('1/1/2000', periods=1000))
tsdf.apply(lambda x: x.idxmax())

A   2001-10-28
B   2002-01-22
C   2000-09-24
dtype: datetime64[ns]

You may also pass additional arguments and keyword arguments to the [apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply)) method. For instance, consider the following function you would like to apply:

In [112]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

You may then apply this function as follows:

In [113]:
df.apply(subtract_and_divide, args=(5,), divide=3)

        one       two     three
a -1.732801 -1.499645       NaN
b -1.315075 -1.158811 -1.444440
c -1.857627 -1.677833 -1.363305
d       NaN -1.733857 -1.991541

Another useful feature is the ability to pass Series methods to carry out some Series operation on each column or row:

In [114]:
tsdf

                   A         B         C
2000-01-01 -0.456814  1.203967  1.066329
2000-01-02 -0.337482 -0.927469  0.158203
2000-01-03 -1.856399  0.620635  1.855636
2000-01-04 -0.204655 -1.964850  1.259651
2000-01-05 -0.227710 -0.005435 -0.406736
2000-01-06 -1.014077 -0.888974  0.168130
2000-01-07 -1.907666 -0.744173  0.108151
2000-01-08 -0.666921  0.524366 -2.127730
2000-01-09  1.999377  0.104054 -1.452097
2000-01-10 -0.039091 -0.580234 -1.132075
2000-01-11  1.175617 -0.929087 -0.456910
2000-01-12  0.450349 -0.151906 -0.611431
2000-01-13  1.455976 -0.196490 -0.679923
2000-01-14 -1.112099  0.509526 -0.744569
2000-01-15 -0.032836  0.241462  0.325187
2000-01-16 -0.136881 -0.071374 -0.546874
2000-01-17 -2.484132 -1.511423  1.833937
2000-01-18  1.726674  1.879554  1.317895
2000-01-19  0.770003  0.662505 -0.049122
2000-01-20  0.914847 -1.896458 -0.059007
2000-01-21 -0.353809  1.041684 -0.702611
2000-01-22 -0.462437 -0.425763  0.310673
2000-01-23  0.498506  0.435997 -0.552664
2000-01-24 -0.034255  0.030924  0.310060
2000-01-25  0.837947 -0.087422  1.126642
2000-01-26  0.852446 -0.658670  0.196992
2000-01-27  0.963458 -0.341879 -0.706998
2000-01-28  0.103948  0.216262 -1.112190
2000-01-29 -0.546171 -1.199632 -0.643110
2000-01-30  0.505267 -0.279140 -0.287424
...              ...       ...       ...
2002-08-28 -0.761604 -0.707261  0.975053
2002-08-29  1.870901  1.062131 -0.864267
2002-08-30 -0.990695  1.339959  0.588951
2002-08-31 -0.304138 -0.774910 -0.681157
2002-09-01 -0.853068 -0.127540  0.213789
2002-09-02  0.031799  1.013716 -0.206967
2002-09-03  2.649861 -0.167355  0.719252
2002-09-04 -0.055867  0.412408  0.699384
2002-09-05  0.703283  0.241860  0.006015
2002-09-06  0.494984 -1.915383 -0.208651
2002-09-07  0.096646 -0.105733 -0.144377
2002-09-08  0.460544 -0.012460  0.069642
2002-09-09  2.785056 -1.404821  0.589755
2002-09-10  0.162336 -1.885696  1.842468
2002-09-11  0.661859  0.235388  0.302342
2002-09-12 -1.524637 -0.498652  1.559520
2002-09-13  0.328652 -0.464772 -0.913839
2002-09-14 -0.779383 -1.614227  1.826613
2002-09-15  0.683551  0.832737  0.043712
2002-09-16  0.754461 -0.755508  0.961868
2002-09-17  0.331469 -0.026382 -0.207995
2002-09-18  0.154310 -0.284127 -3.231600
2002-09-19 -1.109751 -0.080296 -2.307540
2002-09-20 -1.216371 -1.331473 -1.290427
2002-09-21 -0.079388  1.009421  0.507024
2002-09-22 -1.265375 -0.777007  0.897432
2002-09-23 -0.661557 -0.354027 -1.604133
2002-09-24  0.294525 -1.955084 -1.255296
2002-09-25  0.724232  0.738057  0.195150
2002-09-26 -0.281035  1.583563 -1.148588

[1000 rows x 3 columns]

In [115]:
tsdf.apply(pd.Series.interpolate)

                   A         B         C
2000-01-01 -0.456814  1.203967  1.066329
2000-01-02 -0.337482 -0.927469  0.158203
2000-01-03 -1.856399  0.620635  1.855636
2000-01-04 -0.204655 -1.964850  1.259651
2000-01-05 -0.227710 -0.005435 -0.406736
2000-01-06 -1.014077 -0.888974  0.168130
2000-01-07 -1.907666 -0.744173  0.108151
2000-01-08 -0.666921  0.524366 -2.127730
2000-01-09  1.999377  0.104054 -1.452097
2000-01-10 -0.039091 -0.580234 -1.132075
2000-01-11  1.175617 -0.929087 -0.456910
2000-01-12  0.450349 -0.151906 -0.611431
2000-01-13  1.455976 -0.196490 -0.679923
2000-01-14 -1.112099  0.509526 -0.744569
2000-01-15 -0.032836  0.241462  0.325187
2000-01-16 -0.136881 -0.071374 -0.546874
2000-01-17 -2.484132 -1.511423  1.833937
2000-01-18  1.726674  1.879554  1.317895
2000-01-19  0.770003  0.662505 -0.049122
2000-01-20  0.914847 -1.896458 -0.059007
2000-01-21 -0.353809  1.041684 -0.702611
2000-01-22 -0.462437 -0.425763  0.310673
2000-01-23  0.498506  0.435997 -0.552664
2000-01-24 -0.034255  0.030924  0.310060
2000-01-25  0.837947 -0.087422  1.126642
2000-01-26  0.852446 -0.658670  0.196992
2000-01-27  0.963458 -0.341879 -0.706998
2000-01-28  0.103948  0.216262 -1.112190
2000-01-29 -0.546171 -1.199632 -0.643110
2000-01-30  0.505267 -0.279140 -0.287424
...              ...       ...       ...
2002-08-28 -0.761604 -0.707261  0.975053
2002-08-29  1.870901  1.062131 -0.864267
2002-08-30 -0.990695  1.339959  0.588951
2002-08-31 -0.304138 -0.774910 -0.681157
2002-09-01 -0.853068 -0.127540  0.213789
2002-09-02  0.031799  1.013716 -0.206967
2002-09-03  2.649861 -0.167355  0.719252
2002-09-04 -0.055867  0.412408  0.699384
2002-09-05  0.703283  0.241860  0.006015
2002-09-06  0.494984 -1.915383 -0.208651
2002-09-07  0.096646 -0.105733 -0.144377
2002-09-08  0.460544 -0.012460  0.069642
2002-09-09  2.785056 -1.404821  0.589755
2002-09-10  0.162336 -1.885696  1.842468
2002-09-11  0.661859  0.235388  0.302342
2002-09-12 -1.524637 -0.498652  1.559520
2002-09-13  0.328652 -0.464772 -0.913839
2002-09-14 -0.779383 -1.614227  1.826613
2002-09-15  0.683551  0.832737  0.043712
2002-09-16  0.754461 -0.755508  0.961868
2002-09-17  0.331469 -0.026382 -0.207995
2002-09-18  0.154310 -0.284127 -3.231600
2002-09-19 -1.109751 -0.080296 -2.307540
2002-09-20 -1.216371 -1.331473 -1.290427
2002-09-21 -0.079388  1.009421  0.507024
2002-09-22 -1.265375 -0.777007  0.897432
2002-09-23 -0.661557 -0.354027 -1.604133
2002-09-24  0.294525 -1.955084 -1.255296
2002-09-25  0.724232  0.738057  0.195150
2002-09-26 -0.281035  1.583563 -1.148588

[1000 rows x 3 columns]

Finally, [apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply) takes an argument `raw` which is False by default, which converts each row or column into a Series before applying the function. When set to True, the passed function will instead receive an ndarray object, which has positive performance implications if you do not need the indexing functionality.

### Aggregation API
The aggregation API allows one to express possibly multiple aggregation operations in a single concise way. This API is similar across pandas objects, see [groupby API](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html#groupby-aggregate), the [window functions API](https://pandas.pydata.org/pandas-docs/stable/user_guide/computation.html#stats-aggregate), and the [resample API](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-aggregate). The entry point for aggregation is [DataFrame.aggregate()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html#pandas.DataFrame.aggregate), or the alias [DataFrame.agg()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.agg.html#pandas.DataFrame.agg).

We will use a similar starting frame from above:

In [116]:
tsdf = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],
                    index=pd.date_range('1/1/2000', periods=10))
tsdf.iloc[3:7] = np.nan
tsdf

                   A         B         C
2000-01-01  0.535287 -1.958783 -1.154397
2000-01-02 -1.650984 -0.349827  0.083429
2000-01-03  0.687676 -0.879759 -1.823490
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08 -0.133903  0.442304 -0.483593
2000-01-09 -1.651573 -0.279431  0.294184
2000-01-10 -0.751398 -0.599987  1.599655

Using a single function is equivalent to [apply()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.apply.html#pandas.DataFrame.apply). You can also pass named methods as strings. These will return a `Series` of the aggregated output:

In [117]:
tsdf.agg(np.sum)

A   -2.964894
B   -3.625483
C   -1.484213
dtype: float64

In [118]:
tsdf.agg('sum')

A   -2.964894
B   -3.625483
C   -1.484213
dtype: float64

In [119]:
# these are equivalent to a ``.sum()`` because we are aggregating
# on a single function
tsdf.sum()

A   -2.964894
B   -3.625483
C   -1.484213
dtype: float64

Single aggregations on a `Series` this will return a scalar value:

In [120]:
tsdf['A'].agg('sum')

-2.9648938434917795

### Aggregating with multiple functions
You can pass multiple aggregation arguments as a list. The results of each of the passed functions will be a row in the resulting DataFrame. These are naturally named from the aggregation function.

In [121]:
tsdf.agg(['sum'])

            A         B         C
sum -2.964894 -3.625483 -1.484213

Multiple functions yield multiple rows:

In [122]:
tsdf.agg(['sum', 'mean'])

             A         B         C
sum  -2.964894 -3.625483 -1.484213
mean -0.494149 -0.604247 -0.247369

On a `Series`, multiple functions return a `Series`, indexed by the function names:

In [123]:
tsdf['A'].agg(['sum', 'mean'])

sum    -2.964894
mean   -0.494149
Name: A, dtype: float64

Passing a `lambda` function will yield a `<lambda>` named row:

In [124]:
tsdf['A'].agg(['sum', lambda x: x.mean()])

sum        -2.964894
<lambda>   -0.494149
Name: A, dtype: float64

Passing a named function will yield that name for the row:

In [125]:
def mymean(x):
     return x.mean()

tsdf['A'].agg(['sum', mymean])

sum      -2.964894
mymean   -0.494149
Name: A, dtype: float64

### Aggregating with a dict
Passing a dictionary of column names to a scalar or a list of scalars, to `DataFrame.agg` allows you to customize which functions are applied to which columns. Note that the results are not in any particular order, you can use an `OrderedDict` instead to guarantee ordering.

In [126]:
tsdf.agg({'A': 'mean', 'B': 'sum'})

A   -0.494149
B   -3.625483
dtype: float64

Passing a list-like will generate a `DataFrame` output. You will get a matrix-like output of all of the aggregators. The output will consist of all unique functions. Those that are not noted for a particular column will be `NaN`:

In [127]:
tsdf.agg({'A': ['mean', 'min'], 'B': 'sum'})

             A         B
mean -0.494149       NaN
min  -1.651573       NaN
sum        NaN -3.625483

### Mixed dtypes
When presented with mixed dtypes that cannot aggregate, `.agg` will only take the valid aggregations. This is similar to how groupby `.agg` works.

In [128]:
mdf = pd.DataFrame({'A': [1, 2, 3],
                    'B': [1., 2., 3.],
                    'C': ['foo', 'bar', 'baz'],
                    'D': pd.date_range('20130101', periods=3)})
mdf.dtypes

A             int64
B           float64
C            object
D    datetime64[ns]
dtype: object

In [129]:
mdf.agg(['min', 'sum'])

     A    B          C          D
min  1  1.0        bar 2013-01-01
sum  6  6.0  foobarbaz        NaT

### Custom describe
With `.agg()` is it possible to easily create a custom describe function, similar to the built in describe function.

In [130]:
from functools import partial
q_25          = partial(pd.Series.quantile, q=0.25)
q_25.__name__ = '25%'
q_75          = partial(pd.Series.quantile, q=0.75)
q_75.__name__ = '75%'
tsdf.agg(['count', 'mean', 'std', 'min', q_25, 'median', q_75, 'max'])

               A         B         C
count   6.000000  6.000000  6.000000
mean   -0.494149 -0.604247 -0.247369
std     1.032502  0.797019  1.198070
min    -1.651573 -1.958783 -1.823490
25%    -1.426087 -0.809816 -0.986696
median -0.442651 -0.474907 -0.200082
75%     0.367990 -0.297030  0.241495
max     0.687676  0.442304  1.599655

## Transform API
The [transform()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html#pandas.DataFrame.transform) method returns an object that is indexed the same (same size) as the original. This API allows you to provide multiple operations at the same time rather than one-by-one. Its API is quite similar to the `.agg` API.

We create a frame similar to the one used in the above sections.

In [131]:
tsdf = pd.DataFrame(np.random.randn(10, 3), columns=['A', 'B', 'C'],
                    index=pd.date_range('1/1/2000', periods=10))
tsdf.iloc[3:7] = np.nan
tsdf

                   A         B         C
2000-01-01  1.958040  0.680420 -0.601617
2000-01-02 -1.056278  0.784300  1.948765
2000-01-03  2.242345  0.809949 -1.517156
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08 -0.823107  0.817727 -0.990285
2000-01-09 -1.650400 -0.657380  0.934584
2000-01-10  1.026366 -0.480463 -0.430908

Transform the entire frame. `.transform()` allows input functions as: a NumPy function, a string function name or a user defined function.

In [132]:
tsdf.transform(np.abs)

                   A         B         C
2000-01-01  1.958040  0.680420  0.601617
2000-01-02  1.056278  0.784300  1.948765
2000-01-03  2.242345  0.809949  1.517156
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  0.823107  0.817727  0.990285
2000-01-09  1.650400  0.657380  0.934584
2000-01-10  1.026366  0.480463  0.430908

In [133]:
tsdf.transform('abs')

                   A         B         C
2000-01-01  1.958040  0.680420  0.601617
2000-01-02  1.056278  0.784300  1.948765
2000-01-03  2.242345  0.809949  1.517156
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  0.823107  0.817727  0.990285
2000-01-09  1.650400  0.657380  0.934584
2000-01-10  1.026366  0.480463  0.430908

In [134]:
tsdf.transform(lambda x: x.abs())

                   A         B         C
2000-01-01  1.958040  0.680420  0.601617
2000-01-02  1.056278  0.784300  1.948765
2000-01-03  2.242345  0.809949  1.517156
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  0.823107  0.817727  0.990285
2000-01-09  1.650400  0.657380  0.934584
2000-01-10  1.026366  0.480463  0.430908

Here [transform()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.transform.html#pandas.DataFrame.transform) received a single function; this is equivalent to a ufunc application.

In [135]:
np.abs(tsdf)

                   A         B         C
2000-01-01  1.958040  0.680420  0.601617
2000-01-02  1.056278  0.784300  1.948765
2000-01-03  2.242345  0.809949  1.517156
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  0.823107  0.817727  0.990285
2000-01-09  1.650400  0.657380  0.934584
2000-01-10  1.026366  0.480463  0.430908

Passing a single function to `.transform()` with a `Series` will yield a single `Series` in return.

In [136]:
tsdf['A'].transform(np.abs)

2000-01-01    1.958040
2000-01-02    1.056278
2000-01-03    2.242345
2000-01-04         NaN
2000-01-05         NaN
2000-01-06         NaN
2000-01-07         NaN
2000-01-08    0.823107
2000-01-09    1.650400
2000-01-10    1.026366
Freq: D, Name: A, dtype: float64

### Transform with multiple functions
Passing multiple functions will yield a column MultiIndexed DataFrame. The first level will be the original frame column names; the second level will be the names of the transforming functions.

In [137]:
tsdf.transform([np.abs, lambda x: x + 1])

                   A                   B                   C
            absolute  <lambda>  absolute  <lambda>  absolute  <lambda>
2000-01-01  1.958040  2.958040  0.680420  1.680420  0.601617  0.398383
2000-01-02  1.056278 -0.056278  0.784300  1.784300  1.948765  2.948765
2000-01-03  2.242345  3.242345  0.809949  1.809949  1.517156 -0.517156
2000-01-04       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN       NaN       NaN
2000-01-08  0.823107  0.176893  0.817727  1.817727  0.990285  0.009715
2000-01-09  1.650400 -0.650400  0.657380  0.342620  0.934584  1.934584
2000-01-10  1.026366  2.026366  0.480463  0.519537  0.430908  0.569092

Passing multiple functions to a Series will yield a DataFrame. The resulting column names will be the transforming functions.

In [138]:
tsdf['A'].transform([np.abs, lambda x: x + 1])

            absolute  <lambda>
2000-01-01  1.958040  2.958040
2000-01-02  1.056278 -0.056278
2000-01-03  2.242345  3.242345
2000-01-04       NaN       NaN
2000-01-05       NaN       NaN
2000-01-06       NaN       NaN
2000-01-07       NaN       NaN
2000-01-08  0.823107  0.176893
2000-01-09  1.650400 -0.650400
2000-01-10  1.026366  2.026366

### Transforming with a dict
Passing a dict of functions will allow selective transforming per column.

In [139]:
tsdf.transform({'A': np.abs, 'B': lambda x: x + 1})

                   A         B
2000-01-01  1.958040  1.680420
2000-01-02  1.056278  1.784300
2000-01-03  2.242345  1.809949
2000-01-04       NaN       NaN
2000-01-05       NaN       NaN
2000-01-06       NaN       NaN
2000-01-07       NaN       NaN
2000-01-08  0.823107  1.817727
2000-01-09  1.650400  0.342620
2000-01-10  1.026366  0.519537

Passing a dict of lists will generate a MultiIndexed DataFrame with these selective transforms.

In [140]:
tsdf.transform({'A': np.abs, 'B': [lambda x: x + 1, 'sqrt']})

C:\bin\anaconda3\lib\site-packages\pandas\core\base.py:323: RuntimeWarning: invalid value encountered in sqrt
  return f(self, *args, **kwargs)

                   A         B
            absolute  <lambda>      sqrt
2000-01-01  1.958040  1.680420  0.824876
2000-01-02  1.056278  1.784300  0.885607
2000-01-03  2.242345  1.809949  0.899971
2000-01-04       NaN       NaN       NaN
2000-01-05       NaN       NaN       NaN
2000-01-06       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN
2000-01-08  0.823107  1.817727  0.904283
2000-01-09  1.650400  0.342620       NaN
2000-01-10  1.026366  0.519537       NaN

## Applying elementwise functions
Since not all functions can be vectorized (accept NumPy arrays and return another array or value), the methods [applymap()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.applymap.html#pandas.DataFrame.applymap) on DataFrame and analogously [map()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html#pandas.Series.map) on Series accept any Python function taking a single value and returning a single value. For example:

In [141]:
df4 = pd.DataFrame({'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
                    'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})
df4

        one       two     three
a -0.581388 -2.664578       NaN
b  0.956000  0.712026  1.580898
c -1.418698  0.278031  0.485732
d       NaN  0.564821  0.646211

In [142]:
def f(x):
    return len(str(x))

In [143]:
df4['one'].map(f)

a    19
b    18
c    19
d     3
Name: one, dtype: int64

In [144]:
df4.applymap(f)

   one  two  three
a   19   18      3
b   18   18     18
c   19   19     18
d    3   18     18

[Series.map()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.map.html#pandas.Series.map) has an additional feature; it can be used to easily “link” or “map” values defined by a secondary series. This is closely related to [merging/joining functionality](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html#merging):

In [145]:
s = pd.Series(['six', 'seven', 'six', 'seven', 'six'],
              index=['a', 'b', 'c', 'd', 'e'])
t = pd.Series({'six': 6., 'seven': 7.})
s

a      six
b    seven
c      six
d    seven
e      six
dtype: object

In [146]:
s.map(t)

a    6.0
b    7.0
c    6.0
d    7.0
e    6.0
dtype: float64

## Reindexing and altering labels
[reindex()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.reindex.html#pandas.Series.reindex) is the fundamental data alignment method in pandas. It is used to implement nearly all other features relying on label-alignment functionality. To reindex means to conform the data to match a given set of labels along a particular axis. This accomplishes several things:

* Reorders the existing data to match a new set of labels
* Inserts missing value (NA) markers in label locations where no data for that label existed
* If specified, **fill** data for missing labels using logic (highly relevant to working with time series data)

Here is a simple example:

In [147]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s

a    1.023048
b   -1.567170
c    0.191696
d   -0.720277
e    0.424675
dtype: float64

In [148]:
s.reindex(['e', 'b', 'f', 'd'])

e    0.424675
b   -1.567170
f         NaN
d   -0.720277
dtype: float64

Here, the `f` label was not contained in the Series and hence appears as `NaN` in the result.

With a DataFrame, you can simultaneously reindex the index and columns:

In [149]:
df

        one       two     three
a -0.198403  0.501065       NaN
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086
d       NaN -0.201570 -0.974622

In [150]:
df.reindex(index=['c', 'f', 'b'], columns=['three', 'two', 'one'])

      three       two       one
c  0.910086 -0.033498 -0.572882
f       NaN       NaN       NaN
b  0.666681  1.523568  1.054774

You may also use `reindex` with an `axis` keyword:

In [151]:
df.reindex(['c', 'f', 'b'], axis='index')

        one       two     three
c -0.572882 -0.033498  0.910086
f       NaN       NaN       NaN
b  1.054774  1.523568  0.666681

Note that the `Index` objects containing the actual axis labels can be **shared** between objects. So if we have a Series and a DataFrame, the following can be done:

In [152]:
rs = s.reindex(df.index)
rs

a    1.023048
b   -1.567170
c    0.191696
d   -0.720277
dtype: float64

In [153]:
rs.index is df.index

True

This means that the reindexed Series’s index is the same Python object as the DataFrame’s index.

_**New in version 0.21.0**_.

DataFrame.reindex() also supports an “axis-style” calling convention, where you specify a single `labels` argument and the `axis` it applies to.

In [154]:
df.reindex(['c', 'f', 'b'], axis='index')

        one       two     three
c -0.572882 -0.033498  0.910086
f       NaN       NaN       NaN
b  1.054774  1.523568  0.666681

In [155]:
df.reindex(['three', 'two', 'one'], axis='columns')

      three       two       one
a       NaN  0.501065 -0.198403
b  0.666681  1.523568  1.054774
c  0.910086 -0.033498 -0.572882
d -0.974622 -0.201570       NaN

>**See also**
>
>MultiIndex / Advanced Indexing is an even more concise way of doing reindexing.

>**Note**
>
>When writing performance-sensitive code, there is a good reason to spend some time becoming a reindexing ninja: many operations are faster on pre-aligned data. Adding two unaligned DataFrames internally triggers a reindexing step. For exploratory analysis you will hardly notice the difference (because reindex has been heavily optimized), but when CPU cycles matter sprinkling a few explicit reindex calls here and there can have an impact.

### Reindexing to align with another object
You may wish to take an object and reindex its axes to be labeled the same as another object. While the syntax for this is straightforward albeit verbose, it is a common enough operation that the [reindex_like()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reindex_like.html#pandas.DataFrame.reindex_like) method is available to make this simpler:

In [156]:
df2 = pd.DataFrame({'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
                    'two': pd.Series(np.random.randn(3), index=['a', 'b', 'c'])})
df2

        one       two
a  1.006978  0.839282
b -0.820383 -1.170304
c  0.393827  0.978719

In [157]:
df3 = pd.DataFrame({'one': pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e']),
                    'two': pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])})
df3

        one       two
a -0.883976  1.166086
b  0.390931 -0.086850
c  0.608719  0.539187
d -0.521557 -0.723828
e -1.048213 -0.925507

In [158]:
# this will drop the 'd' and 'e' columns on 'df3'
df3.reindex_like(df2)

        one       two
a -0.883976  1.166086
b  0.390931 -0.086850
c  0.608719  0.539187

### Aligning objects with each other with `align`
The [align()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.align.html#pandas.Series.align) method is the fastest way to simultaneously align two objects. It supports a `join` argument (related to [joining and merging](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html#merging)):
* **join='outer'**: take the union of the indexes (default)
* **join='left'**: use the calling object’s index
* **join='right'**: use the passed object’s index
* **join='inner'**: intersect the indexes

It returns a tuple with both of the reindexed Series:

In [159]:
s  = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
s1 = s[:4]
s2 = s[1:]
s1.align(s2)

(a   -0.166888
 b    0.647196
 c   -0.758085
 d    1.961035
 e         NaN
 dtype: float64, a         NaN
 b    0.647196
 c   -0.758085
 d    1.961035
 e   -0.397269
 dtype: float64)

In [160]:
s1.align(s2, join='inner')

(b    0.647196
 c   -0.758085
 d    1.961035
 dtype: float64, b    0.647196
 c   -0.758085
 d    1.961035
 dtype: float64)

In [161]:
s1.align(s2, join='left')

(a   -0.166888
 b    0.647196
 c   -0.758085
 d    1.961035
 dtype: float64, a         NaN
 b    0.647196
 c   -0.758085
 d    1.961035
 dtype: float64)

For DataFrames, the join method will be applied to both the index and the
columns by default:

In [162]:
df.align(df2, join='inner')

(        one       two
 a -0.198403  0.501065
 b  1.054774  1.523568
 c -0.572882 -0.033498,         one       two
 a  1.006978  0.839282
 b -0.820383 -1.170304
 c  0.393827  0.978719)

You can also pass an `axis` option to only align on the specified axis:

In [163]:
df.align(df2, join='inner', axis=0)

(        one       two     three
 a -0.198403  0.501065       NaN
 b  1.054774  1.523568  0.666681
 c -0.572882 -0.033498  0.910086,         one       two
 a  1.006978  0.839282
 b -0.820383 -1.170304
 c  0.393827  0.978719)

If you pass a Series to [DataFrame.align](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.align.html#pandas.DataFrame.align), you can choose to align both objects either on the DataFrame's index or columns using the `axis` argument:

In [164]:
df.align(df2.iloc[0], axis=1)

(        one     three       two
 a -0.198403       NaN  0.501065
 b  1.054774  0.666681  1.523568
 c -0.572882  0.910086 -0.033498
 d       NaN -0.974622 -0.201570, one      1.006978
 three         NaN
 two      0.839282
 Name: a, dtype: float64)

### Filling while reindexing
[reindex](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.reindex.html#pandas.Series.reindex) takes an optional parameter `method` which is a filling method chosen from the following table:

| Method           | Action                            |
|------------------|-----------------------------------|
| pad / ffill      | Fill values forward               |
| bfill / backfill | Fill values backward              |
| nearest          | Fill from the nearest index value |

We illustrate these fill methods on a simple Series:

In [165]:
rng = pd.date_range('1/3/2000', periods=8)
ts  = pd.Series(np.random.randn(8), index=rng)
ts2 = ts[[0, 3, 6]]
ts

2000-01-03    1.964482
2000-01-04    0.209206
2000-01-05    0.126862
2000-01-06    0.366896
2000-01-07    0.423927
2000-01-08   -1.084242
2000-01-09   -0.863106
2000-01-10   -0.545591
Freq: D, dtype: float64

In [166]:
ts2

2000-01-03    1.964482
2000-01-06    0.366896
2000-01-09   -0.863106
dtype: float64

In [167]:
ts2.reindex(ts.index)

2000-01-03    1.964482
2000-01-04         NaN
2000-01-05         NaN
2000-01-06    0.366896
2000-01-07         NaN
2000-01-08         NaN
2000-01-09   -0.863106
2000-01-10         NaN
Freq: D, dtype: float64

In [168]:
ts2.reindex(ts.index, method='ffill')

2000-01-03    1.964482
2000-01-04    1.964482
2000-01-05    1.964482
2000-01-06    0.366896
2000-01-07    0.366896
2000-01-08    0.366896
2000-01-09   -0.863106
2000-01-10   -0.863106
Freq: D, dtype: float64

In [169]:
ts2.reindex(ts.index, method='bfill')

2000-01-03    1.964482
2000-01-04    0.366896
2000-01-05    0.366896
2000-01-06    0.366896
2000-01-07   -0.863106
2000-01-08   -0.863106
2000-01-09   -0.863106
2000-01-10         NaN
Freq: D, dtype: float64

In [170]:
   ts2.reindex(ts.index, method='nearest')

2000-01-03    1.964482
2000-01-04    1.964482
2000-01-05    0.366896
2000-01-06    0.366896
2000-01-07    0.366896
2000-01-08   -0.863106
2000-01-09   -0.863106
2000-01-10   -0.863106
Freq: D, dtype: float64

These methods require that the indexes are **ordered** increasing or decreasing.

Note that the same result could have been achieved using fillna (except for `method='nearest'`) or interpolate:

In [171]:
ts2.reindex(ts.index).fillna(method='ffill')

2000-01-03    1.964482
2000-01-04    1.964482
2000-01-05    1.964482
2000-01-06    0.366896
2000-01-07    0.366896
2000-01-08    0.366896
2000-01-09   -0.863106
2000-01-10   -0.863106
Freq: D, dtype: float64

[reindex()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.reindex.html#pandas.Series.reindex) will raise a ValueError if the index is not monotonically increasing or decreasing. fillna() and [interpolate()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.interpolate.html#pandas.Series.interpolate) will not perform any checks on the order of the index.

### Limits on filling while reindexing
The `limit` and `tolerance` arguments provide additional control over filling while reindexing. Limit specifies the maximum count of consecutive matches:

In [172]:
ts2.reindex(ts.index, method='ffill', limit=1)

2000-01-03    1.964482
2000-01-04    1.964482
2000-01-05         NaN
2000-01-06    0.366896
2000-01-07    0.366896
2000-01-08         NaN
2000-01-09   -0.863106
2000-01-10   -0.863106
Freq: D, dtype: float64

In contrast, tolerance specifies the maximum distance between the index and
indexer values:

In [173]:
ts2.reindex(ts.index, method='ffill', tolerance='1 day')

2000-01-03    1.964482
2000-01-04    1.964482
2000-01-05         NaN
2000-01-06    0.366896
2000-01-07    0.366896
2000-01-08         NaN
2000-01-09   -0.863106
2000-01-10   -0.863106
Freq: D, dtype: float64

Notice that when used on a `DatetimeIndex`, `TimedeltaIndex` or `PeriodIndex`, `tolerance` will coerced into a `Timedelta` if possible. This allows you to specify tolerance with appropriate strings.

### Dropping labels from an axis
A method closely related to `reindex` is the drop() function. It removes a set of labels from an axis:

In [174]:
df

        one       two     three
a -0.198403  0.501065       NaN
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086
d       NaN -0.201570 -0.974622

In [175]:
df.drop(['a', 'd'], axis=0)

        one       two     three
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086

In [176]:
df.drop(['one'], axis=1)

        two     three
a  0.501065       NaN
b  1.523568  0.666681
c -0.033498  0.910086
d -0.201570 -0.974622

>**Note** that the following also works, but is a bit less obvious / clean:

In [177]:
df.reindex(df.index.difference(['a', 'd']))

        one       two     three
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086

## Renaming / mapping labels
The [rename()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html#pandas.DataFrame.rename) method allows you to relabel an axis based on some mapping (a dict or Series) or an arbitrary function.

In [178]:
s

a   -0.166888
b    0.647196
c   -0.758085
d    1.961035
e   -0.397269
dtype: float64

In [179]:
s.rename(str.upper)

A   -0.166888
B    0.647196
C   -0.758085
D    1.961035
E   -0.397269
dtype: float64

If you pass a function, it must return a value when called with any of the labels (and must produce a set of unique values). A dict or Series can also be used:

In [180]:
df.rename(columns={'one': 'foo', 'two': 'bar'},
          index={'a': 'apple', 'b': 'banana', 'd': 'durian'})

             foo       bar     three
apple  -0.198403  0.501065       NaN
banana  1.054774  1.523568  0.666681
c      -0.572882 -0.033498  0.910086
durian       NaN -0.201570 -0.974622

If the mapping doesn’t include a column/index label, it isn’t renamed. Note that extra labels in the mapping don’t throw an error.

_**New in version 0.21.0**_.

[DataFrame.rename()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html#pandas.DataFrame.rename) also supports an “axis-style” calling convention, where you specify a single `mapper` and the `axis` to apply that mapping to.

In [181]:
df.rename({'one': 'foo', 'two': 'bar'}, axis='columns')

        foo       bar     three
a -0.198403  0.501065       NaN
b  1.054774  1.523568  0.666681
c -0.572882 -0.033498  0.910086
d       NaN -0.201570 -0.974622

In [182]:
df.rename({'a': 'apple', 'b': 'banana', 'd': 'durian'}, axis='index')

             one       two     three
apple  -0.198403  0.501065       NaN
banana  1.054774  1.523568  0.666681
c      -0.572882 -0.033498  0.910086
durian       NaN -0.201570 -0.974622

The [rename()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html#pandas.DataFrame.rename) method also provides an `inplace` named parameter that is by default `False` and copies the underlying data. Pass `inplace=True` to rename the data in place.

Finally, rename() also accepts a scalar or list-like for altering the `Series.name` attribute.

In [183]:
s.rename("scalar-name")

a   -0.166888
b    0.647196
c   -0.758085
d    1.961035
e   -0.397269
Name: scalar-name, dtype: float64

_**New in version 0.24.0**_.

The methods [rename_axis()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename_axis.html#pandas.DataFrame.rename_axis) and [rename_axis()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.rename_axis.html#pandas.Series.rename_axis) allow specific names of a _MultiIndex_ to be changed (as opposed to the labels).

In [184]:
df = pd.DataFrame({'x': [1, 2, 3, 4, 5, 6],
                    'y': [10, 20, 30, 40, 50, 60]},
                   index=pd.MultiIndex.from_product([['a', 'b', 'c'], [1, 2]],
                   names=['let', 'num']))
df

         x   y
let num
a   1    1  10
    2    2  20
b   1    3  30
    2    4  40
c   1    5  50
    2    6  60

In [185]:
df.rename_axis(index={'let': 'abc'})

         x   y
abc num
a   1    1  10
    2    2  20
b   1    3  30
    2    4  40
c   1    5  50
    2    6  60

In [186]:
df.rename_axis(index=str.upper)

         x   y
LET NUM
a   1    1  10
    2    2  20
b   1    3  30
    2    4  40
c   1    5  50
    2    6  60

## Iteration
The behavior of basic iteration over pandas objects depends on the type. When iterating over a Series, it is regarded as array-like, and basic iteration produces the values. DataFrames follow the dict-like convention of iterating over the “keys” of the objects.

In short, basic iteration (`for i in object`) produces:

* **Series**: values
* **DataFrame**: column labels

Thus, for example, iterating over a DataFrame gives you the column names:

In [187]:
df = pd.DataFrame({'col1': np.random.randn(3),
                   'col2': np.random.randn(3)}, index=['a', 'b', 'c'])

for col in df:
    print(col)

col1
col2

Pandas objects also have the dict-like [items()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.items.html#pandas.DataFrame.items) method to iterate over the (key, value) pairs.

To iterate over the rows of a DataFrame, you can use the following methods:

* [iterrows()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iterrows.html#pandas.DataFrame.iterrows): Iterate over the rows of a DataFrame as (index, Series) pairs. This converts the rows to Series objects, which can change the dtypes and has some performance implications.
* [itertuples()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.itertuples.html#pandas.DataFrame.itertuples): Iterate over the rows of a DataFrame as namedtuples of the values. This is a lot faster than [iterrows()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iterrows.html#pandas.DataFrame.iterrows), and is in most cases preferable to use to iterate over the values of a DataFrame.

>**Warning**
>
>Iterating through pandas objects is generally slow. In many cases, iterating manually over the rows is not needed and can be avoided with one of the following approaches:
>
>* Look for a vectorized solution: many operations can be performed using built-in methods or NumPy functions, (boolean) indexing, …
>* When you have a function that cannot work on the full DataFrame/Series at once, it is better to use apply() instead of iterating over the values. See the docs on function application.
>* If you need to do iterative manipulations on the values but performance is important, consider writing the inner loop with cython or numba. See the enhancing performance section for some examples of this approach.

>**Warning**
>
>You should never modify something you are iterating over. This is not guaranteed to work in all cases. Depending on the data types, the iterator returns a copy and not a view, and writing to it will have no effect!
>
>For example, in the following case setting the value has no effect:

```
In [252]: df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})

In [253]: for index, row in df.iterrows():
   .....:     row['a'] = 10
   .....: 

In [254]: df
Out[254]: 
   a  b
0  1  a
1  2  b
2  3  c
```
### items
Consistent with the dict-like interface, [items()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.items.html#pandas.DataFrame.items) iterates through key-value pairs:

* **Series**: (index, scalar value) pairs
* **DataFrame**: (column, Series) pairs

For example:

In [188]:
for label, ser in df.items():
    print(label)
    print(ser)

col1
a   -0.983535
b    0.069836
c    0.749117
Name: col1, dtype: float64
col2
a    1.000676
b   -0.461006
c   -0.020178
Name: col2, dtype: float64

### iterrows
[iterrows()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iterrows.html#pandas.DataFrame.iterrows) allows you to iterate through the rows of a DataFrame as Series objects. It returns an iterator yielding each index value along with a Series containing the data in each row:

In [189]:
for row_index, row in df.iterrows():
    print(row_index, row, sep='\n')

a
col1   -0.983535
col2    1.000676
Name: a, dtype: float64
b
col1    0.069836
col2   -0.461006
Name: b, dtype: float64
c
col1    0.749117
col2   -0.020178
Name: c, dtype: float64

>**Note**
>
>Because `iterrows()` returns a Series for each row, it does **not** preserve dtypes across the rows (dtypes are preserved across columns for DataFrames). For example,

```
In [258]: df_orig.dtypes
Out[258]: 
int        int64
float    float64
dtype: object

In [259]: row = next(df_orig.iterrows())[1]

In [260]: row
Out[260]: 
int      1.0
float    1.5
Name: 0, dtype: float64
```
>All values in `row`, returned as a Series, are now upcasted to floats, also the original integer value in column x:

```
In [261]: row['int'].dtype
Out[261]: dtype('float64')

In [262]: df_orig['int'].dtype
Out[262]: dtype('int64')
```
>To preserve dtypes while iterating over the rows, it is better to use `itertuples()` which returns namedtuples of the values and which is generally much faster than `iterrows()`.

For instance, a contrived way to transpose the DataFrame would be:

In [190]:
df2 = pd.DataFrame({'x': [1, 2, 3], 'y': [4, 5, 6]})
print(df2)

   x  y
0  1  4
1  2  5
2  3  6

In [191]:
print(df2.T)

   0  1  2
x  1  2  3
y  4  5  6

In [192]:
df2_t = pd.DataFrame({idx: values for idx, values in df2.iterrows()})
print(df2_t)

   0  1  2
x  1  2  3
y  4  5  6

### itertuples
The [itertuples()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.itertuples.html#pandas.DataFrame.itertuples) method will return an iterator yielding a namedtuple for each row in the DataFrame. The first element of the tuple will be the row’s corresponding index value, while the remaining values are the row values.

For instance:

In [193]:
for row in df.itertuples():
    print(row)

Pandas(Index='a', col1=-0.9835354803568331, col2=1.0006760145031988)
Pandas(Index='b', col1=0.06983624585290574, col2=-0.4610061975957483)
Pandas(Index='c', col1=0.7491167787130326, col2=-0.020178192633739794)

This method does not convert the row to a Series object; it merely returns the values inside a namedtuple. Therefore, [itertuples()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.itertuples.html#pandas.DataFrame.itertuples) preserves the data type of the values and is generally faster as [iterrows()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iterrows.html#pandas.DataFrame.iterrows).

>**Note**
>
>The column names will be renamed to positional names if they are invalid Python identifiers, repeated, or start with an underscore. With a large number of columns (>255), regular tuples are returned.

## .dt accessor
Series has an accessor to succinctly return datetime like properties for the values of the Series, if it is a datetime/period like Series. This will return a Series, indexed like the existing Series.

In [194]:
# datetime
s = pd.Series(pd.date_range('20130101 09:10:12', periods=4))
s

0   2013-01-01 09:10:12
1   2013-01-02 09:10:12
2   2013-01-03 09:10:12
3   2013-01-04 09:10:12
dtype: datetime64[ns]

In [195]:
s.dt.hour

0    9
1    9
2    9
3    9
dtype: int64

In [196]:
s.dt.second

0    12
1    12
2    12
3    12
dtype: int64

In [197]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

This enables nice expressions like this:

In [198]:
s[s.dt.day == 2]

1   2013-01-02 09:10:12
dtype: datetime64[ns]

You can easily produces tz aware transformations:

In [199]:
stz = s.dt.tz_localize('US/Eastern')
stz

0   2013-01-01 09:10:12-05:00
1   2013-01-02 09:10:12-05:00
2   2013-01-03 09:10:12-05:00
3   2013-01-04 09:10:12-05:00
dtype: datetime64[ns, US/Eastern]

In [200]:
stz.dt.tz

You can also chain these types of operations:

In [201]:
s.dt.tz_localize('UTC').dt.tz_convert('US/Eastern')

0   2013-01-01 04:10:12-05:00
1   2013-01-02 04:10:12-05:00
2   2013-01-03 04:10:12-05:00
3   2013-01-04 04:10:12-05:00
dtype: datetime64[ns, US/Eastern]

You can also format datetime values as strings with [Series.dt.strftime()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dt.strftime.html#pandas.Series.dt.strftime) which supports the same format as the standard [strftime()](https://docs.python.org/3/library/datetime.html#datetime.datetime.strftime).

In [202]:
# DatetimeIndex
s = pd.Series(pd.date_range('20130101', periods=4))
s

0   2013-01-01
1   2013-01-02
2   2013-01-03
3   2013-01-04
dtype: datetime64[ns]

In [203]:
s.dt.strftime('%Y/%m/%d')

0    2013/01/01
1    2013/01/02
2    2013/01/03
3    2013/01/04
dtype: object

In [204]:
# PeriodIndex
s = pd.Series(pd.period_range('20130101', periods=4))
s

0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
dtype: period[D]

In [205]:
s.dt.strftime('%Y/%m/%d')

0    2013/01/01
1    2013/01/02
2    2013/01/03
3    2013/01/04
dtype: object

The `.dt` accessor works for period and timedelta dtypes.

In [206]:
# period
s = pd.Series(pd.period_range('20130101', periods=4, freq='D'))
s

0    2013-01-01
1    2013-01-02
2    2013-01-03
3    2013-01-04
dtype: period[D]

In [207]:
s.dt.year

0    2013
1    2013
2    2013
3    2013
dtype: int64

In [208]:
s.dt.day

0    1
1    2
2    3
3    4
dtype: int64

In [209]:
# timedelta
s = pd.Series(pd.timedelta_range('1 day 00:00:05', periods=4, freq='s'))
s

0   1 days 00:00:05
1   1 days 00:00:06
2   1 days 00:00:07
3   1 days 00:00:08
dtype: timedelta64[ns]

In [210]:
s.dt.days

0    1
1    1
2    1
3    1
dtype: int64

In [211]:
s.dt.seconds

0    5
1    6
2    7
3    8
dtype: int64

In [212]:
s.dt.components

   days  hours  minutes  seconds  milliseconds  microseconds  nanoseconds
0     1      0        0        5             0             0            0
1     1      0        0        6             0             0            0
2     1      0        0        7             0             0            0
3     1      0        0        8             0             0            0

>**Note**
>
>`Series.dt` will raise a `TypeError` if you access with a non-datetime-like values.

## Vectorized string methods
Series is equipped with a set of string processing methods that make it easy to operate on each element of the array. Perhaps most importantly, these methods exclude missing/NA values automatically. These are accessed via the Series’s `str` attribute and generally have names matching the equivalent (scalar) built-in string methods. For example:

In [213]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'],
              dtype="str")
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

Powerful pattern-matching methods are provided as well, but note that pattern-matching generally uses regular expressions by default (and in some cases always uses them).

>**Note**
>
>Prior to pandas 1.0, string methods were only available on `object` -dtype `Series`. Pandas 1.0 added the `StringDtype` which is dedicated to strings. See `Text Data Types` for more.

Please see Vectorized String Methods for a complete description.

## Sorting
Pandas supports three kinds of sorting: sorting by index labels, sorting by column values, and sorting by a combination of both.

### By index
The Series.sort_index() and DataFrame.sort_index() methods are used to sort a pandas object by its index levels.

In [214]:
df = pd.DataFrame({
     'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
     'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
     'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

unsorted_df = df.reindex(index=['a', 'd', 'c', 'b'],
                         columns=['three', 'two', 'one'])

unsorted_df

      three       two       one
a       NaN -1.059309 -0.341523
d  0.703468  1.066463       NaN
c -1.759252 -0.333574 -1.202226
b -0.301067 -1.229505  0.073337

In [215]:
unsorted_df.sort_index()

      three       two       one
a       NaN -1.059309 -0.341523
b -0.301067 -1.229505  0.073337
c -1.759252 -0.333574 -1.202226
d  0.703468  1.066463       NaN

In [216]:
unsorted_df.sort_index(ascending=False)

      three       two       one
d  0.703468  1.066463       NaN
c -1.759252 -0.333574 -1.202226
b -0.301067 -1.229505  0.073337
a       NaN -1.059309 -0.341523

In [217]:
unsorted_df.sort_index(axis=1)

        one     three       two
a -0.341523       NaN -1.059309
d       NaN  0.703468  1.066463
c -1.202226 -1.759252 -0.333574
b  0.073337 -0.301067 -1.229505

In [218]:
unsorted_df['three'].sort_index()

a         NaN
b   -0.301067
c   -1.759252
d    0.703468
Name: three, dtype: float64

### By values
The [Series.sort_values()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.sort_values.html#pandas.Series.sort_values) method is used to sort a _Series_ by its values. The [DataFrame.sort_values()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values) method is used to sort a _DataFrame_ by its column or row values. The optional `by` parameter to [DataFrame.sort_values()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values) may used to specify one or more columns to use to determine the sorted order.

In [219]:
df1 = pd.DataFrame({'one': [2, 1, 1, 1],
                    'two': [1, 3, 2, 4],
                    'three': [5, 4, 3, 2]})
df1.sort_values(by='two')

   one  two  three
0    2    1      5
2    1    2      3
1    1    3      4
3    1    4      2

The `by` parameter can take a list of column names, e.g.:

In [220]:
df1[['one', 'two', 'three']].sort_values(by=['one', 'two'])

   one  two  three
2    1    2      3
1    1    3      4
3    1    4      2
0    2    1      5

These methods have special treatment of NA values via the `na_position` argument:

In [221]:
s[2] = np.nan
s.sort_values()

0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
2     NaN
5     NaN
dtype: object

In [222]:
s.sort_values(na_position='first')

2     NaN
5     NaN
0       A
3    Aaba
1       B
4    Baca
6    CABA
8     cat
7     dog
dtype: object

### By indexes and values
_**New in version 0.23.0**_.

Strings passed as the `by` parameter to [DataFrame.sort_values()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html#pandas.DataFrame.sort_values) may refer to either columns or index level names.

In [223]:
idx = pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('a', 2),
                                ('b', 2), ('b', 1), ('b', 1)])
idx.names = ['first', 'second']

# Build DataFrame
df_multi = pd.DataFrame({'A': np.arange(6, 0, -1)},
                        index=idx)

df_multi

              A
first second
a     1       6
      2       5
      2       4
b     2       3
      1       2
      1       1

Sort by ‘second’ (index) and ‘A’ (column)

In [224]:
df_multi.sort_values(by=['second', 'A'])

              A
first second
b     1       1
      1       2
a     1       6
b     2       3
a     2       4
      2       5

>**Note**
>
>If a string matches both a column name and an index level name then a warning is issued and the column takes precedence. This will result in an ambiguity error in a future version.

### searchsorted
Series has the [searchsorted()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.searchsorted.html#pandas.Series.searchsorted) method, which works similarly to [numpy.ndarray.searchsorted()](https://docs.scipy.org/doc/numpy/reference/generated/numpy.ndarray.searchsorted.html#numpy.ndarray.searchsorted).

In [225]:
ser = pd.Series([1, 2, 3])
ser.searchsorted([0, 3])

array([0, 2], dtype=int64)

In [226]:
ser.searchsorted([0, 4])

array([0, 3], dtype=int64)

In [227]:
ser.searchsorted([1, 3], side='right')

array([1, 3], dtype=int64)

In [228]:
ser.searchsorted([1, 3], side='left')

array([0, 2], dtype=int64)

In [229]:
ser = pd.Series([3, 1, 2])
ser.searchsorted([0, 3], sorter=np.argsort(ser))

array([0, 2], dtype=int64)

### smallest / largest values
`Series` has the [nsmallest()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.nsmallest.html#pandas.Series.nsmallest) and [nlargest()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.nlargest.html#pandas.Series.nlargest) methods which return the smallest or largest _**n**_ values. For a large `Series` this can be much faster than sorting the entire Series and calling `head(n)` on the result.

In [230]:
s = pd.Series(np.random.permutation(10))
s

0    2
1    9
2    8
3    6
4    4
5    1
6    3
7    0
8    7
9    5
dtype: int32

In [231]:
s.sort_values()

7    0
5    1
0    2
6    3
4    4
9    5
3    6
8    7
2    8
1    9
dtype: int32

In [232]:
s.nsmallest(3)

7    0
5    1
0    2
dtype: int32

In [233]:
s.nlargest(3)

1    9
2    8
8    7
dtype: int32

`DataFrame` also has the `nlargest` and `nsmallest` methods.

In [234]:
df = pd.DataFrame({'a': [-2, -1, 1, 10, 8, 11, -1],
                   'b': list('abdceff'),
                   'c': [1.0, 2.0, 4.0, 3.2, np.nan, 3.0, 4.0]})
df.nlargest(3, 'a')

    a  b    c
5  11  f  3.0
3  10  c  3.2
4   8  e  NaN

In [235]:
df.nlargest(5, ['a', 'c'])

    a  b    c
5  11  f  3.0
3  10  c  3.2
4   8  e  NaN
2   1  d  4.0
6  -1  f  4.0

In [236]:
df.nsmallest(3, 'a')

   a  b    c
0 -2  a  1.0
1 -1  b  2.0
6 -1  f  4.0

In [237]:
df.nsmallest(5, ['a', 'c'])

   a  b    c
0 -2  a  1.0
1 -1  b  2.0
6 -1  f  4.0
2  1  d  4.0
4  8  e  NaN

### Sorting by a MultiIndex column
You must be explicit about sorting when the column is a MultiIndex, and fully specify all levels to `by`.

In [238]:
df1.columns = pd.MultiIndex.from_tuples([('a', 'one'),
                                         ('a', 'two'),
                                         ('b', 'three')])
df1.sort_values(by=('a', 'two'))

    a         b
  one two three
0   2   1     5
2   1   2     3
1   1   3     4
3   1   4     2

## Copying
The [copy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.copy.html#pandas.DataFrame.copy) method on pandas objects copies the underlying data (though not the axis indexes, since they are immutable) and returns a new object. Note that **it is seldom necessary to copy objects**. For example, there are only a handful of ways to alter a DataFrame in-place:

* Inserting, deleting, or modifying a column.
* Assigning to the `index` or `columns` attributes.
* For homogeneous data, directly modifying the values via the `values` attribute or advanced indexing.

To be clear, no pandas method has the side effect of modifying your data; almost every method returns a new object, leaving the original object untouched. If the data is modified, it is because you did so explicitly.

### dtypes
For the most part, pandas uses NumPy arrays and dtypes for Series or individual columns of a DataFrame. NumPy provides support for `float`, `int`, `bool`, `timedelta64[ns]` and datetime64[ns] (note that NumPy does not support timezone-aware datetimes).

Pandas and third-party libraries extend NumPy’s type system in a few places. This section describes the extensions pandas has made internally. See [Extension types](https://pandas.pydata.org/pandas-docs/stable/development/extending.html#extending-extension-types) for how to write your own extension that works with pandas. See [Extension data types](https://pandas.pydata.org/pandas-docs/stable/ecosystem.html#ecosystem-extensions) for a list of third-party libraries that have implemented an extension.

The following table lists all of pandas extension types. For methods requiring `dtype` arguments, strings can be specified as indicated. See the respective documentation sections for more on each type.

| Kind of Data       | Data Type       | Scalar    | Array                | String Aliases                           | Documentation            |
|--------------------|-----------------|-----------|----------------------|------------------------------------------|--------------------------|
| tz-aware datetime  | [DatetimeTZDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DatetimeTZDtype.html#pandas.DatetimeTZDtype) | [Timestamp](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timestamp.html#pandas.Timestamp) | [arrays.DatetimeArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.arrays.DatetimeArray.html#pandas.arrays.DatetimeArray) | 'datetime64[ns, <tz>]'                   | [Time zone handling](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-timezone)       |
| Categorical        | [CategoricalDtype](https://pandas.pydata.org/pandas-https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Timestamp.html#pandas.Timestampdocs/stable/reference/api/pandas.CategoricalDtype.html#pandas.CategoricalDtype)| (none)    | [Categorical](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Categorical.html#pandas.Categorical)          | 'category'                               | [Categorical data](https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html#categorical)         |
| period (time spans)| [PeriodDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.PeriodDtype.html#pandas.PeriodDtype)     | [Period](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Period.html#pandas.Period)    | [arrays.PeriodArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.arrays.PeriodArray.html#pandas.arrays.PeriodArray)   | 'period[<freq>]', 'Period[<freq>]'       | [Time span representation](https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#timeseries-periods) |
| sparse             | [SparseDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.SparseDtype.html#pandas.SparseDtype)     | (none)    | [arrays.SparseArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.arrays.SparseArray.html#pandas.arrays.SparseArray)   | 'Sparse', 'Sparse[int]', 'Sparse[float]' | [Sparse data structures](https://pandas.pydata.org/pandas-docs/stable/user_guide/sparse.html#sparse)   |
| intervals          | [IntervalDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.IntervalDtype.html#pandas.IntervalDtype)   | [Interval](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Interval.html#pandas.Interval)  | [arrays.IntervalArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.arrays.IntervalArray.html#pandas.arrays.IntervalArray) | 'interval', 'Interval', 'Interval[<numpy_dtype>]', 'Interval[datetime64[ns, <tz>]]', 'Interval[timedelta64[<freq>]]' | [IntervalIndex](https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#advanced-intervalindex) |
| nullable integer   | [Int64Dtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Int64Dtype.html#pandas.Int64Dtype), …   | (none)    | [arrays.IntegerArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.arrays.IntegerArray.html#pandas.arrays.IntegerArray)  | 'Int8', 'Int16', 'Int32', 'Int64', 'UInt8', 'UInt16', 'UInt32', 'UInt64' | [Nullable integer data type](https://pandas.pydata.org/pandas-docs/stable/user_guide/integer_na.html#integer-na) |
| Strings            | [StringDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.StringDtype.html#pandas.StringDtype)     | [str](https://docs.python.org/3/library/stdtypes.html#str)       | [arrays.StringArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.arrays.StringArray.html#pandas.arrays.StringArray)   | 'string'                                 | [Working with text data](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text)   |
| Boolean (with NA)  | [BooleanDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.BooleanDtype.html#pandas.BooleanDtype)    | [bool](https://docs.python.org/3/library/functions.html#bool)      | [arrays.BooleanArray](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.arrays.BooleanArray.html#pandas.arrays.BooleanArray)  | 'boolean'                                | [Boolean data with missing values](https://pandas.pydata.org/pandas-docs/stable/reference/arrays.html#api-arrays-bool) |

Pandas has two ways to store strings.

1. `object` dtype, which can hold any Python object, including strings.
2. [StringDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.StringDtype.html#pandas.StringDtype), which is dedicated to strings.

Generally, we recommend using [StringDtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.StringDtype.html#pandas.StringDtype). See [Text Data Types](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-types) for more.

Finally, arbitrary objects may be stored using the `object` dtype, but should be avoided to the extent possible (for performance and interoperability with other libraries and methods. See [object conversion](https://pandas.pydata.org/pandas-docs/stable/getting_started/basics.html#basics-object-conversion)).

A convenient [dtypes](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dtypes.html#pandas.DataFrame.dtypes) attribute for DataFrame returns a Series with the data type of each column.

In [239]:
dft = pd.DataFrame({'A': np.random.rand(3),
                    'B': 1,
                    'C': 'foo',
                    'D': pd.Timestamp('20010102'),
                    'E': pd.Series([1.0] * 3).astype('float32'),
                    'F': False,
                    'G': pd.Series([1] * 3, dtype='int8')})
dft

          A  B    C          D    E      F  G
0  0.431765  1  foo 2001-01-02  1.0  False  1
1  0.461753  1  foo 2001-01-02  1.0  False  1
2  0.828971  1  foo 2001-01-02  1.0  False  1

In [240]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

On a `Series` object, use the [dtype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.dtype.html#pandas.Series.dtype) attribute.

In [241]:
dft['A'].dtype

dtype('float64')

If a pandas object contains data with multiple dtypes _in a single column_, the dtype of the column will be chosen to accommodate all of the data types (`object` is the most general).

In [242]:
# these ints are coerced to floats
pd.Series([1, 2, 3, 4, 5, 6.])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [243]:
# string data forces an ``object`` dtype
pd.Series([1, 2, 3, 6., 'foo'])

0      1
1      2
2      3
3      6
4    foo
dtype: object

The number of columns of each type in a `DataFrame` can be found by calling `DataFrame.dtypes.value_counts()`.

In [244]:
dft.dtypes.value_counts()

int8              1
float64           1
object            1
int64             1
datetime64[ns]    1
float32           1
bool              1
dtype: int64

Numeric dtypes will propagate and can coexist in DataFrames. If a dtype is passed (either directly via the `dtype` keyword, a passed `ndarray`, or a passed `Series`), then it will be preserved in DataFrame operations. Furthermore, different numeric dtypes will **NOT** be combined. The following example will give you a taste.

In [245]:
df1 = pd.DataFrame(np.random.randn(8, 1), columns=['A'], dtype='float32')
df1

          A
0  0.187061
1  0.971499
2  1.337700
3 -0.522375
4  0.903376
5 -0.369465
6 -0.570343
7 -0.874137

In [246]:
df1.dtypes

A    float32
dtype: object

In [247]:
df2 = pd.DataFrame({'A': pd.Series(np.random.randn(8), dtype='float16'),
                    'B': pd.Series(np.random.randn(8)),
                    'C': pd.Series(np.array(np.random.randn(8),
                    dtype='uint8'))})
df2

          A         B  C
0 -0.089966 -0.564300  1
1 -1.712891  0.739121  0
2 -1.805664 -0.313204  1
3 -2.078125 -0.222399  0
4 -0.814941  0.153650  0
5 -0.019669  0.202430  0
6  0.103394  2.948886  0
7 -2.656250 -2.081631  0

In [248]:
df2.dtypes

A    float16
B    float64
C      uint8
dtype: object

### defaults
By default integer types are `int64` and float types are `float64`, regardless of platform (32-bit or 64-bit). The following will all result in `int64` dtypes.

In [249]:
pd.DataFrame([1, 2], columns=['a']).dtypes

a    int64
dtype: object

In [250]:
pd.DataFrame({'a': [1, 2]}).dtypes

a    int64
dtype: object

In [251]:
pd.DataFrame({'a': 1}, index=list(range(2))).dtypes

a    int64
dtype: object

Note that Numpy will choose platform-dependent types when creating arrays. The following **WILL** result in `int32` on 32-bit platform.

In [252]:
frame = pd.DataFrame(np.array([1, 2]))

### upcasting
Types can potentially be upcasted when combined with other types, meaning they are promoted from the current type (e.g. `int` to `float`).

In [253]:
df3 = df1.reindex_like(df2).fillna(value=0.0) + df2
df3

          A         B    C
0  0.097096 -0.564300  1.0
1 -0.741392  0.739121  0.0
2 -0.467964 -0.313204  1.0
3 -2.600500 -0.222399  0.0
4  0.088434  0.153650  0.0
5 -0.389134  0.202430  0.0
6 -0.466950  2.948886  0.0
7 -3.530387 -2.081631  0.0

In [254]:
df3.dtypes

A    float32
B    float64
C    float64
dtype: object

[DataFrame.to_numpy()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_numpy.html#pandas.DataFrame.to_numpy) will return the lower-common-denominator of the dtypes, meaning the dtype that can accommodate **ALL** of the types in the resulting homogeneous dtyped NumPy array. This can force some upcasting.

In [255]:
df3.to_numpy().dtype

dtype('float64')

### astype
You can use the [astype()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html#pandas.DataFrame.astype) method to explicitly convert dtypes from one to another. These will by default return a copy, even if the dtype was unchanged (pass `copy=False` to change this behavior). In addition, they will raise an exception if the astype operation is invalid.

Upcasting is always according to the **numpy** rules. If two different dtypes are involved in an operation, then the more general one will be used as the result of the operation.

In [256]:
df3

          A         B    C
0  0.097096 -0.564300  1.0
1 -0.741392  0.739121  0.0
2 -0.467964 -0.313204  1.0
3 -2.600500 -0.222399  0.0
4  0.088434  0.153650  0.0
5 -0.389134  0.202430  0.0
6 -0.466950  2.948886  0.0
7 -3.530387 -2.081631  0.0

In [257]:
df3.dtypes

A    float32
B    float64
C    float64
dtype: object

In [258]:
# conversion of dtypes
df3.astype('float32').dtypes

A    float32
B    float32
C    float32
dtype: object

Convert a subset of columns to a specified type using [astype()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html#pandas.DataFrame.astype).

In [259]:
dft = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
dft[['a', 'b']] = dft[['a', 'b']].astype(np.uint8)
dft

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [260]:
dft.dtypes

a    uint8
b    uint8
c    int64
dtype: object

Convert certain columns to a specific dtype by passing a dict to [astype()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html#pandas.DataFrame.astype).

In [261]:
dft1 = pd.DataFrame({'a': [1, 0, 1], 'b': [4, 5, 6], 'c': [7, 8, 9]})
dft1 = dft1.astype({'a': np.bool, 'c': np.float64})
dft1

       a  b    c
0   True  4  7.0
1  False  5  8.0
2   True  6  9.0

In [262]:
dft1.dtypes

a       bool
b      int64
c    float64
dtype: object

>**Note**
>
>When trying to convert a subset of columns to a specified type using astype() and loc(), upcasting occurs.
>
>loc() tries to fit in what we are assigning to the current dtypes, while [] will overwrite them taking the dtype from the right hand side. Therefore the following piece of code produces the unintended result.

```
In [365]: dft = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})

In [366]: dft.loc[:, ['a', 'b']].astype(np.uint8).dtypes
Out[366]: 
a    uint8
b    uint8
dtype: object

In [367]: dft.loc[:, ['a', 'b']] = dft.loc[:, ['a', 'b']].astype(np.uint8)

In [368]: dft.dtypes>**
Out[368]: 
a    int64
b    int64
c    int64
dtype: object
```

### object conversion
pandas offers various functions to try to force conversion of types from the `object` dtype to other types. In cases where the data is already of the correct type, but stored in an `object` array, the [DataFrame.infer_objects()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.infer_objects.html#pandas.DataFrame.infer_objects) and [Series.infer_objects()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.infer_objects.html#pandas.Series.infer_objects) methods can be used to soft convert to the correct type.

In [263]:
import datetime
df = pd.DataFrame([[1, 2],
                   ['a', 'b'],
                   [datetime.datetime(2016, 3, 2),
                    datetime.datetime(2016, 3, 2)]])
df = df.T
df

   0  1                    2
0  1  a  2016-03-02 00:00:00
1  2  b  2016-03-02 00:00:00

In [264]:
df.dtypes

0    object
1    object
2    object
dtype: object

Because the data was transposed the original inference stored all columns as object, which `infer_objects` will correct.

In [265]:
df.infer_objects().dtypes

0             int64
1            object
2    datetime64[ns]
dtype: object

The following functions are available for one dimensional object arrays or scalars to perform hard conversion of objects to a specified type:

* [to_numeric()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html#pandas.to_numeric) (conversion to numeric dtypes)

In [266]:
m = ['1.1', 2, 3]
pd.to_numeric(m)

array([1.1, 2. , 3. ])

* [to_datetime()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_datetime.html#pandas.to_datetime) (conversion to datetime objects)

In [267]:
import datetime
m = ['2016-07-09', datetime.datetime(2016, 3, 2)]
pd.to_datetime(m)

DatetimeIndex(['2016-07-09', '2016-03-02'], dtype='datetime64[ns]', freq=None)

* [to_timedelta()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_timedelta.html#pandas.to_timedelta) (conversion to timedelta objects)

In [268]:
m = ['5us', pd.Timedelta('1day')]
pd.to_timedelta(m)

TimedeltaIndex(['0 days 00:00:00.000005', '1 days 00:00:00'], dtype='timedelta64[ns]', freq=None)

To force a conversion, we can pass in an `errors` argument, which specifies how pandas should deal with elements that cannot be converted to desired dtype or object. By default, `errors='raise'`, meaning that any errors encountered will be raised during the conversion process. However, if `errors='coerce'`, these errors will be ignored and pandas will convert problematic elements to `pd.NaT` (for datetime and timedelta) or `np.nan` (for numeric). This might be useful if you are reading in data which is mostly of the desired dtype (e.g. numeric, datetime), but occasionally has non-conforming elements intermixed that you want to represent as missing:

In [269]:
import datetime
m = ['apple', datetime.datetime(2016, 3, 2)]
pd.to_datetime(m, errors='coerce')

DatetimeIndex(['NaT', '2016-03-02'], dtype='datetime64[ns]', freq=None)

In [270]:
m = ['apple', 2, 3]
pd.to_numeric(m, errors='coerce')

array([nan,  2.,  3.])

In [271]:
m = ['apple', pd.Timedelta('1day')]
pd.to_timedelta(m, errors='coerce')

TimedeltaIndex([NaT, '1 days'], dtype='timedelta64[ns]', freq=None)

The `errors` parameter has a third option of `errors='ignore'`, which will simply return the passed in data if it encounters any errors with the conversion to a desired data type:

In [272]:
import datetime
m = ['apple', datetime.datetime(2016, 3, 2)]
pd.to_datetime(m, errors='ignore')

Index(['apple', 2016-03-02 00:00:00], dtype='object')

In [273]:
m = ['apple', 2, 3]
pd.to_numeric(m, errors='ignore')

array(['apple', 2, 3], dtype=object)

In [274]:
m = ['apple', pd.Timedelta('1day')]
pd.to_timedelta(m, errors='ignore')

array(['apple', Timedelta('1 days 00:00:00')], dtype=object)

In addition to object conversion, [to_numeric()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.to_numeric.html#pandas.to_numeric) provides another argument `downcast`, which gives the option of downcasting the newly (or already) numeric data to a smaller dtype, which can conserve memory:

In [275]:
m = ['1', 2, 3]
pd.to_numeric(m, downcast='integer')   # smallest signed int dtype

array([1, 2, 3], dtype=int8)

In [276]:
pd.to_numeric(m, downcast='signed')    # same as 'integer'

array([1, 2, 3], dtype=int8)

In [277]:
pd.to_numeric(m, downcast='unsigned')  # smallest unsigned int dtype

array([1, 2, 3], dtype=uint8)

In [278]:
pd.to_numeric(m, downcast='float')     # smallest float dtype

array([1., 2., 3.], dtype=float32)

As these methods apply only to one-dimensional arrays, lists or scalars; they cannot be used directly on multi-dimensional objects such as DataFrames. However, with apply(), we can “apply” the function over each column efficiently:

In [279]:
import datetime
df = pd.DataFrame([['2016-07-09', datetime.datetime(2016, 3, 2)]] * 2, dtype='O')
df

            0                    1
0  2016-07-09  2016-03-02 00:00:00
1  2016-07-09  2016-03-02 00:00:00

In [280]:
df.apply(pd.to_datetime)

           0          1
0 2016-07-09 2016-03-02
1 2016-07-09 2016-03-02

In [281]:
df = pd.DataFrame([['1.1', 2, 3]] * 2, dtype='O')
df

     0  1  2
0  1.1  2  3
1  1.1  2  3

In [282]:
df.apply(pd.to_numeric)

     0  1  2
0  1.1  2  3
1  1.1  2  3

In [283]:
df = pd.DataFrame([['5us', pd.Timedelta('1day')]] * 2, dtype='O')
df

     0                1
0  5us  1 days 00:00:00
1  5us  1 days 00:00:00

In [284]:
df.apply(pd.to_timedelta)

                0      1
0 00:00:00.000005 1 days
1 00:00:00.000005 1 days

### gotchas
Performing selection operations on `integer` type data can easily upcast the data to `floating`. The dtype of the input data will be preserved in cases where `nans` are not introduced. See also [Support for integer NA](https://pandas.pydata.org/pandas-docs/stable/user_guide/gotchas.html#gotchas-intna).

In [285]:
dfi = df3.astype('int32')
dfi['E'] = 1
dfi

   A  B  C  E
0  0  0  1  1
1  0  0  0  1
2  0  0  1  1
3 -2  0  0  1
4  0  0  0  1
5  0  0  0  1
6  0  2  0  1
7 -3 -2  0  1

In [286]:
dfi.dtypes

A    int32
B    int32
C    int32
E    int64
dtype: object

In [287]:
casted = dfi[dfi > 0]
casted

    A    B    C  E
0 NaN  NaN  1.0  1
1 NaN  NaN  NaN  1
2 NaN  NaN  1.0  1
3 NaN  NaN  NaN  1
4 NaN  NaN  NaN  1
5 NaN  NaN  NaN  1
6 NaN  2.0  NaN  1
7 NaN  NaN  NaN  1

In [288]:
casted.dtypes

A    float64
B    float64
C    float64
E      int64
dtype: object

While float dtypes are unchanged.

In [289]:
dfa = df3.copy()
dfa['A'] = dfa['A'].astype('float32')
dfa.dtypes

A    float32
B    float64
C    float64
dtype: object

In [290]:
casted = dfa[df2 > 0]
casted

         A         B    C
0      NaN       NaN  1.0
1      NaN  0.739121  NaN
2      NaN       NaN  1.0
3      NaN       NaN  NaN
4      NaN  0.153650  NaN
5      NaN  0.202430  NaN
6 -0.46695  2.948886  NaN
7      NaN       NaN  NaN

In [291]:
casted.dtypes

A    float32
B    float64
C    float64
dtype: object

## Selecting columns based on dtype
The [select_dtypes()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.select_dtypes.html#pandas.DataFrame.select_dtypes) method implements subsetting of columns based on their `dtype`.

First, let’s create a [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html#pandas.DataFrame) with a slew of different dtypes:

In [292]:
df = pd.DataFrame({'string': list('abc'),
                   'int64': list(range(1, 4)),
                   'uint8': np.arange(3, 6).astype('u1'),
                   'float64': np.arange(4.0, 7.0),
                   'bool1': [True, False, True],
                   'bool2': [False, True, False],
                   'dates': pd.date_range('now', periods=3),
                   'category': pd.Series(list("ABC")).astype('category')})
df['tdeltas']        = df.dates.diff()
df['uint64']         = np.arange(3, 6).astype('u8')
df['other_dates']    = pd.date_range('20130101', periods=3)
df['tz_aware_dates'] = pd.date_range('20130101', periods=3, tz='US/Eastern')
df

,string,int64,uint8,float64,bool1,bool2,dates,category,tdeltas,uint64,other_dates,tz_aware_dates
0,a,1,3,4.0,True,False,2020-02-02 20:03:44.828407,A,NaT,3,2013-01-01,2013-01-01 00:00:00-05:00
1,b,2,4,5.0,False,True,2020-02-03 20:03:44.828407,B,1 days,4,2013-01-02,2013-01-02 00:00:00-05:00
2,c,3,5,6.0,True,False,2020-02-04 20:03:44.828407,C,1 days,5,2013-01-03,2013-01-03 00:00:00-05:00

And the dtypes:

In [293]:
df.dtypes

string                                object
int64                                  int64
uint8                                  uint8
float64                              float64
bool1                                   bool
bool2                                   bool
dates                         datetime64[ns]
category                            category
tdeltas                      timedelta64[ns]
uint64                                uint64
other_dates                   datetime64[ns]
tz_aware_dates    datetime64[ns, US/Eastern]
dtype: object

[select_dtypes()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.select_dtypes.html#pandas.DataFrame.select_dtypes) has two parameters `include` and `exclude` that allow you to say “give me the columns with these dtypes” (`include`) and/or “give the columns without these dtypes” (`exclude`).

For example, to select `bool` columns:

In [294]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

You can also pass the name of a dtype in the [NumPy dtype hierarchy](https://docs.scipy.org/doc/numpy/reference/arrays.scalars.html):

In [295]:
df.select_dtypes(include=['bool'])

   bool1  bool2
0   True  False
1  False   True
2   True  False

[select_dtypes()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.select_dtypes.html#pandas.DataFrame.select_dtypes) also works with generic dtypes as well.

For example, to select all numeric and boolean columns while excluding unsigned integers:

In [296]:
df.select_dtypes(include=['number', 'bool'], exclude=['unsignedinteger'])

   int64  float64  bool1  bool2 tdeltas
0      1      4.0   True  False     NaT
1      2      5.0  False   True  1 days
2      3      6.0   True  False  1 days

To select string columns you must use the `object` dtype:

In [297]:
df.select_dtypes(include=['object'])

  string
0      a
1      b
2      c

To see all the child dtypes of a generic `dtype` like `numpy.number` you can define a function that returns a tree of child dtypes:

In [298]:
def subdtypes(dtype):
    subs = dtype.__subclasses__()
    if not subs:
        return dtype
    return [dtype, [subdtypes(dt) for dt in subs]]

All NumPy dtypes are subclasses of `numpy.generic`:

In [299]:
subdtypes(np.generic)

[numpy.generic,
 [[numpy.number,
   [[numpy.integer,
     [[numpy.signedinteger,
       [numpy.int8,
        numpy.int16,
        numpy.int32,
        numpy.int32,
        numpy.int64,
        numpy.timedelta64]],
      [numpy.unsignedinteger,
       [numpy.uint8,
        numpy.uint16,
        numpy.uint32,
        numpy.uint32,
        numpy.uint64]]]],
    [numpy.inexact,
     [[numpy.floating,
       [numpy.float16, numpy.float32, numpy.float64, numpy.float64]],
      [numpy.complexfloating,
       [numpy.complex64, numpy.complex128, numpy.complex128]]]]]],
  [numpy.flexible,
   [[numpy.character, [numpy.bytes_, numpy.str_]],
    [numpy.void, [numpy.record]]]],
  numpy.bool_,
  numpy.datetime64,
  numpy.object_]]

>**Note**
>
>Pandas also defines the types `category`, and `datetime64[ns, tz]`, which are not integrated into the normal NumPy hierarchy and won’t show up with the above function.